grevaillot/svd_tools/headers/ATSAM3X8H/pioe.h
#pragma once 

/* --- PIOE: Parallel Input/Output Controller E --------------------- */

/** @defgroup pioe_registers Parallel Input/Output Controller E Register
@{*/

/** PIOE_PER PIO Enable Register **/
#define PIOE_PER			MMIO32(PIOE_BASE + 0x00)
/** PIOE_PDR PIO Disable Register **/
#define PIOE_PDR			MMIO32(PIOE_BASE + 0x04)
/** PIOE_PSR PIO Status Register **/
#define PIOE_PSR			MMIO32(PIOE_BASE + 0x08)
/** PIOE_OER Output Enable Register **/
#define PIOE_OER			MMIO32(PIOE_BASE + 0x10)
/** PIOE_ODR Output Disable Register **/
#define PIOE_ODR			MMIO32(PIOE_BASE + 0x14)
/** PIOE_OSR Output Status Register **/
#define PIOE_OSR			MMIO32(PIOE_BASE + 0x18)
/** PIOE_IFER Glitch Input Filter Enable Register **/
#define PIOE_IFER			MMIO32(PIOE_BASE + 0x20)
/** PIOE_IFDR Glitch Input Filter Disable Register **/
#define PIOE_IFDR			MMIO32(PIOE_BASE + 0x24)
/** PIOE_IFSR Glitch Input Filter Status Register **/
#define PIOE_IFSR			MMIO32(PIOE_BASE + 0x28)
/** PIOE_SODR Set Output Data Register **/
#define PIOE_SODR			MMIO32(PIOE_BASE + 0x30)
/** PIOE_CODR Clear Output Data Register **/
#define PIOE_CODR			MMIO32(PIOE_BASE + 0x34)
/** PIOE_ODSR Output Data Status Register **/
#define PIOE_ODSR			MMIO32(PIOE_BASE + 0x38)
/** PIOE_PDSR Pin Data Status Register **/
#define PIOE_PDSR			MMIO32(PIOE_BASE + 0x3c)
/** PIOE_IER Interrupt Enable Register **/
#define PIOE_IER			MMIO32(PIOE_BASE + 0x40)
/** PIOE_IDR Interrupt Disable Register **/
#define PIOE_IDR			MMIO32(PIOE_BASE + 0x44)
/** PIOE_IMR Interrupt Mask Register **/
#define PIOE_IMR			MMIO32(PIOE_BASE + 0x48)
/** PIOE_ISR Interrupt Status Register **/
#define PIOE_ISR			MMIO32(PIOE_BASE + 0x4c)
/** PIOE_MDER Multi-driver Enable Register **/
#define PIOE_MDER			MMIO32(PIOE_BASE + 0x50)
/** PIOE_MDDR Multi-driver Disable Register **/
#define PIOE_MDDR			MMIO32(PIOE_BASE + 0x54)
/** PIOE_MDSR Multi-driver Status Register **/
#define PIOE_MDSR			MMIO32(PIOE_BASE + 0x58)
/** PIOE_PUDR Pull-up Disable Register **/
#define PIOE_PUDR			MMIO32(PIOE_BASE + 0x60)
/** PIOE_PUER Pull-up Enable Register **/
#define PIOE_PUER			MMIO32(PIOE_BASE + 0x64)
/** PIOE_PUSR Pad Pull-up Status Register **/
#define PIOE_PUSR			MMIO32(PIOE_BASE + 0x68)
/** PIOE_ABSR Peripheral AB Select Register **/
#define PIOE_ABSR			MMIO32(PIOE_BASE + 0x70)
/** PIOE_SCIFSR System Clock Glitch Input Filter Select Register **/
#define PIOE_SCIFSR			MMIO32(PIOE_BASE + 0x80)
/** PIOE_DIFSR Debouncing Input Filter Select Register **/
#define PIOE_DIFSR			MMIO32(PIOE_BASE + 0x84)
/** PIOE_IFDGSR Glitch or Debouncing Input Filter Clock Selection Status Register **/
#define PIOE_IFDGSR			MMIO32(PIOE_BASE + 0x88)
/** PIOE_SCDR Slow Clock Divider Debouncing Register **/
#define PIOE_SCDR			MMIO32(PIOE_BASE + 0x8c)
/** PIOE_OWER Output Write Enable **/
#define PIOE_OWER			MMIO32(PIOE_BASE + 0xa0)
/** PIOE_OWDR Output Write Disable **/
#define PIOE_OWDR			MMIO32(PIOE_BASE + 0xa4)
/** PIOE_OWSR Output Write Status Register **/
#define PIOE_OWSR			MMIO32(PIOE_BASE + 0xa8)
/** PIOE_AIMER Additional Interrupt Modes Enable Register **/
#define PIOE_AIMER			MMIO32(PIOE_BASE + 0xb0)
/** PIOE_AIMDR Additional Interrupt Modes Disables Register **/
#define PIOE_AIMDR			MMIO32(PIOE_BASE + 0xb4)
/** PIOE_AIMMR Additional Interrupt Modes Mask Register **/
#define PIOE_AIMMR			MMIO32(PIOE_BASE + 0xb8)
/** PIOE_ESR Edge Select Register **/
#define PIOE_ESR			MMIO32(PIOE_BASE + 0xc0)
/** PIOE_LSR Level Select Register **/
#define PIOE_LSR			MMIO32(PIOE_BASE + 0xc4)
/** PIOE_ELSR Edge/Level Status Register **/
#define PIOE_ELSR			MMIO32(PIOE_BASE + 0xc8)
/** PIOE_FELLSR Falling Edge/Low Level Select Register **/
#define PIOE_FELLSR			MMIO32(PIOE_BASE + 0xd0)
/** PIOE_REHLSR Rising Edge/ High Level Select Register **/
#define PIOE_REHLSR			MMIO32(PIOE_BASE + 0xd4)
/** PIOE_FRLHSR Fall/Rise - Low/High Status Register **/
#define PIOE_FRLHSR			MMIO32(PIOE_BASE + 0xd8)
/** PIOE_LOCKSR Lock Status **/
#define PIOE_LOCKSR			MMIO32(PIOE_BASE + 0xe0)
/** PIOE_WPMR Write Protect Mode Register **/
#define PIOE_WPMR			MMIO32(PIOE_BASE + 0xe4)
/** PIOE_WPSR Write Protect Status Register **/
#define PIOE_WPSR			MMIO32(PIOE_BASE + 0xe8)

/**@}*/


/** @defgroup pioe_per PER PIO Enable Register
@{*/

/** PIOE_PER_P31 PIO Enable **/
#define PIOE_PER_P31		(1 << 31)
/** PIOE_PER_P30 PIO Enable **/
#define PIOE_PER_P30		(1 << 30)
/** PIOE_PER_P29 PIO Enable **/
#define PIOE_PER_P29		(1 << 29)
/** PIOE_PER_P28 PIO Enable **/
#define PIOE_PER_P28		(1 << 28)
/** PIOE_PER_P27 PIO Enable **/
#define PIOE_PER_P27		(1 << 27)
/** PIOE_PER_P26 PIO Enable **/
#define PIOE_PER_P26		(1 << 26)
/** PIOE_PER_P25 PIO Enable **/
#define PIOE_PER_P25		(1 << 25)
/** PIOE_PER_P24 PIO Enable **/
#define PIOE_PER_P24		(1 << 24)
/** PIOE_PER_P23 PIO Enable **/
#define PIOE_PER_P23		(1 << 23)
/** PIOE_PER_P22 PIO Enable **/
#define PIOE_PER_P22		(1 << 22)
/** PIOE_PER_P21 PIO Enable **/
#define PIOE_PER_P21		(1 << 21)
/** PIOE_PER_P20 PIO Enable **/
#define PIOE_PER_P20		(1 << 20)
/** PIOE_PER_P19 PIO Enable **/
#define PIOE_PER_P19		(1 << 19)
/** PIOE_PER_P18 PIO Enable **/
#define PIOE_PER_P18		(1 << 18)
/** PIOE_PER_P17 PIO Enable **/
#define PIOE_PER_P17		(1 << 17)
/** PIOE_PER_P16 PIO Enable **/
#define PIOE_PER_P16		(1 << 16)
/** PIOE_PER_P15 PIO Enable **/
#define PIOE_PER_P15		(1 << 15)
/** PIOE_PER_P14 PIO Enable **/
#define PIOE_PER_P14		(1 << 14)
/** PIOE_PER_P13 PIO Enable **/
#define PIOE_PER_P13		(1 << 13)
/** PIOE_PER_P12 PIO Enable **/
#define PIOE_PER_P12		(1 << 12)
/** PIOE_PER_P11 PIO Enable **/
#define PIOE_PER_P11		(1 << 11)
/** PIOE_PER_P10 PIO Enable **/
#define PIOE_PER_P10		(1 << 10)
/** PIOE_PER_P9 PIO Enable **/
#define PIOE_PER_P9		(1 << 9)
/** PIOE_PER_P8 PIO Enable **/
#define PIOE_PER_P8		(1 << 8)
/** PIOE_PER_P7 PIO Enable **/
#define PIOE_PER_P7		(1 << 7)
/** PIOE_PER_P6 PIO Enable **/
#define PIOE_PER_P6		(1 << 6)
/** PIOE_PER_P5 PIO Enable **/
#define PIOE_PER_P5		(1 << 5)
/** PIOE_PER_P4 PIO Enable **/
#define PIOE_PER_P4		(1 << 4)
/** PIOE_PER_P3 PIO Enable **/
#define PIOE_PER_P3		(1 << 3)
/** PIOE_PER_P2 PIO Enable **/
#define PIOE_PER_P2		(1 << 2)
/** PIOE_PER_P1 PIO Enable **/
#define PIOE_PER_P1		(1 << 1)
/** PIOE_PER_P0 PIO Enable **/
#define PIOE_PER_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_pdr PDR PIO Disable Register
@{*/

/** PIOE_PDR_P31 PIO Disable **/
#define PIOE_PDR_P31		(1 << 31)
/** PIOE_PDR_P30 PIO Disable **/
#define PIOE_PDR_P30		(1 << 30)
/** PIOE_PDR_P29 PIO Disable **/
#define PIOE_PDR_P29		(1 << 29)
/** PIOE_PDR_P28 PIO Disable **/
#define PIOE_PDR_P28		(1 << 28)
/** PIOE_PDR_P27 PIO Disable **/
#define PIOE_PDR_P27		(1 << 27)
/** PIOE_PDR_P26 PIO Disable **/
#define PIOE_PDR_P26		(1 << 26)
/** PIOE_PDR_P25 PIO Disable **/
#define PIOE_PDR_P25		(1 << 25)
/** PIOE_PDR_P24 PIO Disable **/
#define PIOE_PDR_P24		(1 << 24)
/** PIOE_PDR_P23 PIO Disable **/
#define PIOE_PDR_P23		(1 << 23)
/** PIOE_PDR_P22 PIO Disable **/
#define PIOE_PDR_P22		(1 << 22)
/** PIOE_PDR_P21 PIO Disable **/
#define PIOE_PDR_P21		(1 << 21)
/** PIOE_PDR_P20 PIO Disable **/
#define PIOE_PDR_P20		(1 << 20)
/** PIOE_PDR_P19 PIO Disable **/
#define PIOE_PDR_P19		(1 << 19)
/** PIOE_PDR_P18 PIO Disable **/
#define PIOE_PDR_P18		(1 << 18)
/** PIOE_PDR_P17 PIO Disable **/
#define PIOE_PDR_P17		(1 << 17)
/** PIOE_PDR_P16 PIO Disable **/
#define PIOE_PDR_P16		(1 << 16)
/** PIOE_PDR_P15 PIO Disable **/
#define PIOE_PDR_P15		(1 << 15)
/** PIOE_PDR_P14 PIO Disable **/
#define PIOE_PDR_P14		(1 << 14)
/** PIOE_PDR_P13 PIO Disable **/
#define PIOE_PDR_P13		(1 << 13)
/** PIOE_PDR_P12 PIO Disable **/
#define PIOE_PDR_P12		(1 << 12)
/** PIOE_PDR_P11 PIO Disable **/
#define PIOE_PDR_P11		(1 << 11)
/** PIOE_PDR_P10 PIO Disable **/
#define PIOE_PDR_P10		(1 << 10)
/** PIOE_PDR_P9 PIO Disable **/
#define PIOE_PDR_P9		(1 << 9)
/** PIOE_PDR_P8 PIO Disable **/
#define PIOE_PDR_P8		(1 << 8)
/** PIOE_PDR_P7 PIO Disable **/
#define PIOE_PDR_P7		(1 << 7)
/** PIOE_PDR_P6 PIO Disable **/
#define PIOE_PDR_P6		(1 << 6)
/** PIOE_PDR_P5 PIO Disable **/
#define PIOE_PDR_P5		(1 << 5)
/** PIOE_PDR_P4 PIO Disable **/
#define PIOE_PDR_P4		(1 << 4)
/** PIOE_PDR_P3 PIO Disable **/
#define PIOE_PDR_P3		(1 << 3)
/** PIOE_PDR_P2 PIO Disable **/
#define PIOE_PDR_P2		(1 << 2)
/** PIOE_PDR_P1 PIO Disable **/
#define PIOE_PDR_P1		(1 << 1)
/** PIOE_PDR_P0 PIO Disable **/
#define PIOE_PDR_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_psr PSR PIO Status Register
@{*/

/** PIOE_PSR_P31 PIO Status **/
#define PIOE_PSR_P31		(1 << 31)
/** PIOE_PSR_P30 PIO Status **/
#define PIOE_PSR_P30		(1 << 30)
/** PIOE_PSR_P29 PIO Status **/
#define PIOE_PSR_P29		(1 << 29)
/** PIOE_PSR_P28 PIO Status **/
#define PIOE_PSR_P28		(1 << 28)
/** PIOE_PSR_P27 PIO Status **/
#define PIOE_PSR_P27		(1 << 27)
/** PIOE_PSR_P26 PIO Status **/
#define PIOE_PSR_P26		(1 << 26)
/** PIOE_PSR_P25 PIO Status **/
#define PIOE_PSR_P25		(1 << 25)
/** PIOE_PSR_P24 PIO Status **/
#define PIOE_PSR_P24		(1 << 24)
/** PIOE_PSR_P23 PIO Status **/
#define PIOE_PSR_P23		(1 << 23)
/** PIOE_PSR_P22 PIO Status **/
#define PIOE_PSR_P22		(1 << 22)
/** PIOE_PSR_P21 PIO Status **/
#define PIOE_PSR_P21		(1 << 21)
/** PIOE_PSR_P20 PIO Status **/
#define PIOE_PSR_P20		(1 << 20)
/** PIOE_PSR_P19 PIO Status **/
#define PIOE_PSR_P19		(1 << 19)
/** PIOE_PSR_P18 PIO Status **/
#define PIOE_PSR_P18		(1 << 18)
/** PIOE_PSR_P17 PIO Status **/
#define PIOE_PSR_P17		(1 << 17)
/** PIOE_PSR_P16 PIO Status **/
#define PIOE_PSR_P16		(1 << 16)
/** PIOE_PSR_P15 PIO Status **/
#define PIOE_PSR_P15		(1 << 15)
/** PIOE_PSR_P14 PIO Status **/
#define PIOE_PSR_P14		(1 << 14)
/** PIOE_PSR_P13 PIO Status **/
#define PIOE_PSR_P13		(1 << 13)
/** PIOE_PSR_P12 PIO Status **/
#define PIOE_PSR_P12		(1 << 12)
/** PIOE_PSR_P11 PIO Status **/
#define PIOE_PSR_P11		(1 << 11)
/** PIOE_PSR_P10 PIO Status **/
#define PIOE_PSR_P10		(1 << 10)
/** PIOE_PSR_P9 PIO Status **/
#define PIOE_PSR_P9		(1 << 9)
/** PIOE_PSR_P8 PIO Status **/
#define PIOE_PSR_P8		(1 << 8)
/** PIOE_PSR_P7 PIO Status **/
#define PIOE_PSR_P7		(1 << 7)
/** PIOE_PSR_P6 PIO Status **/
#define PIOE_PSR_P6		(1 << 6)
/** PIOE_PSR_P5 PIO Status **/
#define PIOE_PSR_P5		(1 << 5)
/** PIOE_PSR_P4 PIO Status **/
#define PIOE_PSR_P4		(1 << 4)
/** PIOE_PSR_P3 PIO Status **/
#define PIOE_PSR_P3		(1 << 3)
/** PIOE_PSR_P2 PIO Status **/
#define PIOE_PSR_P2		(1 << 2)
/** PIOE_PSR_P1 PIO Status **/
#define PIOE_PSR_P1		(1 << 1)
/** PIOE_PSR_P0 PIO Status **/
#define PIOE_PSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_oer OER Output Enable Register
@{*/

