grevaillot/svd_tools/headers/ATSAM3X8H/pioe.h
/** PIOE_OER_P31 Output Enable **/
#define PIOE_OER_P31		(1 << 31)
/** PIOE_OER_P30 Output Enable **/
#define PIOE_OER_P30		(1 << 30)
/** PIOE_OER_P29 Output Enable **/
#define PIOE_OER_P29		(1 << 29)
/** PIOE_OER_P28 Output Enable **/
#define PIOE_OER_P28		(1 << 28)
/** PIOE_OER_P27 Output Enable **/
#define PIOE_OER_P27		(1 << 27)
/** PIOE_OER_P26 Output Enable **/
#define PIOE_OER_P26		(1 << 26)
/** PIOE_OER_P25 Output Enable **/
#define PIOE_OER_P25		(1 << 25)
/** PIOE_OER_P24 Output Enable **/
#define PIOE_OER_P24		(1 << 24)
/** PIOE_OER_P23 Output Enable **/
#define PIOE_OER_P23		(1 << 23)
/** PIOE_OER_P22 Output Enable **/
#define PIOE_OER_P22		(1 << 22)
/** PIOE_OER_P21 Output Enable **/
#define PIOE_OER_P21		(1 << 21)
/** PIOE_OER_P20 Output Enable **/
#define PIOE_OER_P20		(1 << 20)
/** PIOE_OER_P19 Output Enable **/
#define PIOE_OER_P19		(1 << 19)
/** PIOE_OER_P18 Output Enable **/
#define PIOE_OER_P18		(1 << 18)
/** PIOE_OER_P17 Output Enable **/
#define PIOE_OER_P17		(1 << 17)
/** PIOE_OER_P16 Output Enable **/
#define PIOE_OER_P16		(1 << 16)
/** PIOE_OER_P15 Output Enable **/
#define PIOE_OER_P15		(1 << 15)
/** PIOE_OER_P14 Output Enable **/
#define PIOE_OER_P14		(1 << 14)
/** PIOE_OER_P13 Output Enable **/
#define PIOE_OER_P13		(1 << 13)
/** PIOE_OER_P12 Output Enable **/
#define PIOE_OER_P12		(1 << 12)
/** PIOE_OER_P11 Output Enable **/
#define PIOE_OER_P11		(1 << 11)
/** PIOE_OER_P10 Output Enable **/
#define PIOE_OER_P10		(1 << 10)
/** PIOE_OER_P9 Output Enable **/
#define PIOE_OER_P9		(1 << 9)
/** PIOE_OER_P8 Output Enable **/
#define PIOE_OER_P8		(1 << 8)
/** PIOE_OER_P7 Output Enable **/
#define PIOE_OER_P7		(1 << 7)
/** PIOE_OER_P6 Output Enable **/
#define PIOE_OER_P6		(1 << 6)
/** PIOE_OER_P5 Output Enable **/
#define PIOE_OER_P5		(1 << 5)
/** PIOE_OER_P4 Output Enable **/
#define PIOE_OER_P4		(1 << 4)
/** PIOE_OER_P3 Output Enable **/
#define PIOE_OER_P3		(1 << 3)
/** PIOE_OER_P2 Output Enable **/
#define PIOE_OER_P2		(1 << 2)
/** PIOE_OER_P1 Output Enable **/
#define PIOE_OER_P1		(1 << 1)
/** PIOE_OER_P0 Output Enable **/
#define PIOE_OER_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_odr ODR Output Disable Register
@{*/

/** PIOE_ODR_P31 Output Disable **/
#define PIOE_ODR_P31		(1 << 31)
/** PIOE_ODR_P30 Output Disable **/
#define PIOE_ODR_P30		(1 << 30)
/** PIOE_ODR_P29 Output Disable **/
#define PIOE_ODR_P29		(1 << 29)
/** PIOE_ODR_P28 Output Disable **/
#define PIOE_ODR_P28		(1 << 28)
/** PIOE_ODR_P27 Output Disable **/
#define PIOE_ODR_P27		(1 << 27)
/** PIOE_ODR_P26 Output Disable **/
#define PIOE_ODR_P26		(1 << 26)
/** PIOE_ODR_P25 Output Disable **/
#define PIOE_ODR_P25		(1 << 25)
/** PIOE_ODR_P24 Output Disable **/
#define PIOE_ODR_P24		(1 << 24)
/** PIOE_ODR_P23 Output Disable **/
#define PIOE_ODR_P23		(1 << 23)
/** PIOE_ODR_P22 Output Disable **/
#define PIOE_ODR_P22		(1 << 22)
/** PIOE_ODR_P21 Output Disable **/
#define PIOE_ODR_P21		(1 << 21)
/** PIOE_ODR_P20 Output Disable **/
#define PIOE_ODR_P20		(1 << 20)
/** PIOE_ODR_P19 Output Disable **/
#define PIOE_ODR_P19		(1 << 19)
/** PIOE_ODR_P18 Output Disable **/
#define PIOE_ODR_P18		(1 << 18)
/** PIOE_ODR_P17 Output Disable **/
#define PIOE_ODR_P17		(1 << 17)
/** PIOE_ODR_P16 Output Disable **/
#define PIOE_ODR_P16		(1 << 16)
/** PIOE_ODR_P15 Output Disable **/
#define PIOE_ODR_P15		(1 << 15)
/** PIOE_ODR_P14 Output Disable **/
#define PIOE_ODR_P14		(1 << 14)
/** PIOE_ODR_P13 Output Disable **/
#define PIOE_ODR_P13		(1 << 13)
/** PIOE_ODR_P12 Output Disable **/
#define PIOE_ODR_P12		(1 << 12)
/** PIOE_ODR_P11 Output Disable **/
#define PIOE_ODR_P11		(1 << 11)
/** PIOE_ODR_P10 Output Disable **/
#define PIOE_ODR_P10		(1 << 10)
/** PIOE_ODR_P9 Output Disable **/
#define PIOE_ODR_P9		(1 << 9)
/** PIOE_ODR_P8 Output Disable **/
#define PIOE_ODR_P8		(1 << 8)
/** PIOE_ODR_P7 Output Disable **/
#define PIOE_ODR_P7		(1 << 7)
/** PIOE_ODR_P6 Output Disable **/
#define PIOE_ODR_P6		(1 << 6)
/** PIOE_ODR_P5 Output Disable **/
#define PIOE_ODR_P5		(1 << 5)
/** PIOE_ODR_P4 Output Disable **/
#define PIOE_ODR_P4		(1 << 4)
/** PIOE_ODR_P3 Output Disable **/
#define PIOE_ODR_P3		(1 << 3)
/** PIOE_ODR_P2 Output Disable **/
#define PIOE_ODR_P2		(1 << 2)
/** PIOE_ODR_P1 Output Disable **/
#define PIOE_ODR_P1		(1 << 1)
/** PIOE_ODR_P0 Output Disable **/
#define PIOE_ODR_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_osr OSR Output Status Register
@{*/

/** PIOE_OSR_P31 Output Status **/
#define PIOE_OSR_P31		(1 << 31)
/** PIOE_OSR_P30 Output Status **/
#define PIOE_OSR_P30		(1 << 30)
/** PIOE_OSR_P29 Output Status **/
#define PIOE_OSR_P29		(1 << 29)
/** PIOE_OSR_P28 Output Status **/
#define PIOE_OSR_P28		(1 << 28)
/** PIOE_OSR_P27 Output Status **/
#define PIOE_OSR_P27		(1 << 27)
/** PIOE_OSR_P26 Output Status **/
#define PIOE_OSR_P26		(1 << 26)
/** PIOE_OSR_P25 Output Status **/
#define PIOE_OSR_P25		(1 << 25)
/** PIOE_OSR_P24 Output Status **/
#define PIOE_OSR_P24		(1 << 24)
/** PIOE_OSR_P23 Output Status **/
#define PIOE_OSR_P23		(1 << 23)
/** PIOE_OSR_P22 Output Status **/
#define PIOE_OSR_P22		(1 << 22)
/** PIOE_OSR_P21 Output Status **/
#define PIOE_OSR_P21		(1 << 21)
/** PIOE_OSR_P20 Output Status **/
#define PIOE_OSR_P20		(1 << 20)
/** PIOE_OSR_P19 Output Status **/
#define PIOE_OSR_P19		(1 << 19)
/** PIOE_OSR_P18 Output Status **/
#define PIOE_OSR_P18		(1 << 18)
/** PIOE_OSR_P17 Output Status **/
#define PIOE_OSR_P17		(1 << 17)
/** PIOE_OSR_P16 Output Status **/
#define PIOE_OSR_P16		(1 << 16)
/** PIOE_OSR_P15 Output Status **/
#define PIOE_OSR_P15		(1 << 15)
/** PIOE_OSR_P14 Output Status **/
#define PIOE_OSR_P14		(1 << 14)
/** PIOE_OSR_P13 Output Status **/
#define PIOE_OSR_P13		(1 << 13)
/** PIOE_OSR_P12 Output Status **/
#define PIOE_OSR_P12		(1 << 12)
/** PIOE_OSR_P11 Output Status **/
#define PIOE_OSR_P11		(1 << 11)
/** PIOE_OSR_P10 Output Status **/
#define PIOE_OSR_P10		(1 << 10)
/** PIOE_OSR_P9 Output Status **/
#define PIOE_OSR_P9		(1 << 9)
/** PIOE_OSR_P8 Output Status **/
#define PIOE_OSR_P8		(1 << 8)
/** PIOE_OSR_P7 Output Status **/
#define PIOE_OSR_P7		(1 << 7)
/** PIOE_OSR_P6 Output Status **/
#define PIOE_OSR_P6		(1 << 6)
/** PIOE_OSR_P5 Output Status **/
#define PIOE_OSR_P5		(1 << 5)
/** PIOE_OSR_P4 Output Status **/
#define PIOE_OSR_P4		(1 << 4)
/** PIOE_OSR_P3 Output Status **/
#define PIOE_OSR_P3		(1 << 3)
/** PIOE_OSR_P2 Output Status **/
#define PIOE_OSR_P2		(1 << 2)
/** PIOE_OSR_P1 Output Status **/
#define PIOE_OSR_P1		(1 << 1)
/** PIOE_OSR_P0 Output Status **/
#define PIOE_OSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_ifer IFER Glitch Input Filter Enable Register
@{*/

/** PIOE_IFER_P31 Input Filter Enable **/
#define PIOE_IFER_P31		(1 << 31)
/** PIOE_IFER_P30 Input Filter Enable **/
#define PIOE_IFER_P30		(1 << 30)
/** PIOE_IFER_P29 Input Filter Enable **/
#define PIOE_IFER_P29		(1 << 29)
/** PIOE_IFER_P28 Input Filter Enable **/
#define PIOE_IFER_P28		(1 << 28)
/** PIOE_IFER_P27 Input Filter Enable **/
#define PIOE_IFER_P27		(1 << 27)
/** PIOE_IFER_P26 Input Filter Enable **/
#define PIOE_IFER_P26		(1 << 26)
/** PIOE_IFER_P25 Input Filter Enable **/
#define PIOE_IFER_P25		(1 << 25)
/** PIOE_IFER_P24 Input Filter Enable **/
#define PIOE_IFER_P24		(1 << 24)
/** PIOE_IFER_P23 Input Filter Enable **/
#define PIOE_IFER_P23		(1 << 23)
/** PIOE_IFER_P22 Input Filter Enable **/
#define PIOE_IFER_P22		(1 << 22)
/** PIOE_IFER_P21 Input Filter Enable **/
#define PIOE_IFER_P21		(1 << 21)
/** PIOE_IFER_P20 Input Filter Enable **/
#define PIOE_IFER_P20		(1 << 20)
/** PIOE_IFER_P19 Input Filter Enable **/
#define PIOE_IFER_P19		(1 << 19)
/** PIOE_IFER_P18 Input Filter Enable **/
#define PIOE_IFER_P18		(1 << 18)
/** PIOE_IFER_P17 Input Filter Enable **/
#define PIOE_IFER_P17		(1 << 17)
/** PIOE_IFER_P16 Input Filter Enable **/
#define PIOE_IFER_P16		(1 << 16)
/** PIOE_IFER_P15 Input Filter Enable **/
#define PIOE_IFER_P15		(1 << 15)
/** PIOE_IFER_P14 Input Filter Enable **/
#define PIOE_IFER_P14		(1 << 14)
/** PIOE_IFER_P13 Input Filter Enable **/
#define PIOE_IFER_P13		(1 << 13)
/** PIOE_IFER_P12 Input Filter Enable **/
#define PIOE_IFER_P12		(1 << 12)
/** PIOE_IFER_P11 Input Filter Enable **/
#define PIOE_IFER_P11		(1 << 11)
/** PIOE_IFER_P10 Input Filter Enable **/
#define PIOE_IFER_P10		(1 << 10)
/** PIOE_IFER_P9 Input Filter Enable **/
#define PIOE_IFER_P9		(1 << 9)
/** PIOE_IFER_P8 Input Filter Enable **/
#define PIOE_IFER_P8		(1 << 8)
/** PIOE_IFER_P7 Input Filter Enable **/
#define PIOE_IFER_P7		(1 << 7)
/** PIOE_IFER_P6 Input Filter Enable **/
#define PIOE_IFER_P6		(1 << 6)
/** PIOE_IFER_P5 Input Filter Enable **/
#define PIOE_IFER_P5		(1 << 5)
/** PIOE_IFER_P4 Input Filter Enable **/
#define PIOE_IFER_P4		(1 << 4)
/** PIOE_IFER_P3 Input Filter Enable **/
#define PIOE_IFER_P3		(1 << 3)
/** PIOE_IFER_P2 Input Filter Enable **/
#define PIOE_IFER_P2		(1 << 2)
/** PIOE_IFER_P1 Input Filter Enable **/
#define PIOE_IFER_P1		(1 << 1)
/** PIOE_IFER_P0 Input Filter Enable **/
#define PIOE_IFER_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_ifdr IFDR Glitch Input Filter Disable Register
@{*/

/** PIOE_IFDR_P31 Input Filter Disable **/
#define PIOE_IFDR_P31		(1 << 31)
/** PIOE_IFDR_P30 Input Filter Disable **/
#define PIOE_IFDR_P30		(1 << 30)
/** PIOE_IFDR_P29 Input Filter Disable **/
#define PIOE_IFDR_P29		(1 << 29)
/** PIOE_IFDR_P28 Input Filter Disable **/
#define PIOE_IFDR_P28		(1 << 28)
/** PIOE_IFDR_P27 Input Filter Disable **/
#define PIOE_IFDR_P27		(1 << 27)
/** PIOE_IFDR_P26 Input Filter Disable **/
#define PIOE_IFDR_P26		(1 << 26)
/** PIOE_IFDR_P25 Input Filter Disable **/
#define PIOE_IFDR_P25		(1 << 25)
/** PIOE_IFDR_P24 Input Filter Disable **/
#define PIOE_IFDR_P24		(1 << 24)
/** PIOE_IFDR_P23 Input Filter Disable **/
#define PIOE_IFDR_P23		(1 << 23)
/** PIOE_IFDR_P22 Input Filter Disable **/
#define PIOE_IFDR_P22		(1 << 22)
/** PIOE_IFDR_P21 Input Filter Disable **/
#define PIOE_IFDR_P21		(1 << 21)
/** PIOE_IFDR_P20 Input Filter Disable **/
#define PIOE_IFDR_P20		(1 << 20)
/** PIOE_IFDR_P19 Input Filter Disable **/
#define PIOE_IFDR_P19		(1 << 19)
/** PIOE_IFDR_P18 Input Filter Disable **/
#define PIOE_IFDR_P18		(1 << 18)
/** PIOE_IFDR_P17 Input Filter Disable **/
#define PIOE_IFDR_P17		(1 << 17)
/** PIOE_IFDR_P16 Input Filter Disable **/
#define PIOE_IFDR_P16		(1 << 16)
/** PIOE_IFDR_P15 Input Filter Disable **/
#define PIOE_IFDR_P15		(1 << 15)
/** PIOE_IFDR_P14 Input Filter Disable **/
#define PIOE_IFDR_P14		(1 << 14)
/** PIOE_IFDR_P13 Input Filter Disable **/
#define PIOE_IFDR_P13		(1 << 13)
/** PIOE_IFDR_P12 Input Filter Disable **/
#define PIOE_IFDR_P12		(1 << 12)
/** PIOE_IFDR_P11 Input Filter Disable **/
#define PIOE_IFDR_P11		(1 << 11)
/** PIOE_IFDR_P10 Input Filter Disable **/
#define PIOE_IFDR_P10		(1 << 10)
/** PIOE_IFDR_P9 Input Filter Disable **/
#define PIOE_IFDR_P9		(1 << 9)
/** PIOE_IFDR_P8 Input Filter Disable **/
#define PIOE_IFDR_P8		(1 << 8)
/** PIOE_IFDR_P7 Input Filter Disable **/
#define PIOE_IFDR_P7		(1 << 7)
/** PIOE_IFDR_P6 Input Filter Disable **/
#define PIOE_IFDR_P6		(1 << 6)
/** PIOE_IFDR_P5 Input Filter Disable **/
#define PIOE_IFDR_P5		(1 << 5)
/** PIOE_IFDR_P4 Input Filter Disable **/
#define PIOE_IFDR_P4		(1 << 4)
/** PIOE_IFDR_P3 Input Filter Disable **/
#define PIOE_IFDR_P3		(1 << 3)
/** PIOE_IFDR_P2 Input Filter Disable **/
#define PIOE_IFDR_P2		(1 << 2)
/** PIOE_IFDR_P1 Input Filter Disable **/
#define PIOE_IFDR_P1		(1 << 1)
/** PIOE_IFDR_P0 Input Filter Disable **/
#define PIOE_IFDR_P0		(1 << 0)

/**@}*/

