grevaillot/svd_tools/headers/ATSAM3X8H/pioe.h
/** @defgroup pioe_ifsr IFSR Glitch Input Filter Status Register
@{*/

/** PIOE_IFSR_P31 Input Filer Status **/
#define PIOE_IFSR_P31		(1 << 31)
/** PIOE_IFSR_P30 Input Filer Status **/
#define PIOE_IFSR_P30		(1 << 30)
/** PIOE_IFSR_P29 Input Filer Status **/
#define PIOE_IFSR_P29		(1 << 29)
/** PIOE_IFSR_P28 Input Filer Status **/
#define PIOE_IFSR_P28		(1 << 28)
/** PIOE_IFSR_P27 Input Filer Status **/
#define PIOE_IFSR_P27		(1 << 27)
/** PIOE_IFSR_P26 Input Filer Status **/
#define PIOE_IFSR_P26		(1 << 26)
/** PIOE_IFSR_P25 Input Filer Status **/
#define PIOE_IFSR_P25		(1 << 25)
/** PIOE_IFSR_P24 Input Filer Status **/
#define PIOE_IFSR_P24		(1 << 24)
/** PIOE_IFSR_P23 Input Filer Status **/
#define PIOE_IFSR_P23		(1 << 23)
/** PIOE_IFSR_P22 Input Filer Status **/
#define PIOE_IFSR_P22		(1 << 22)
/** PIOE_IFSR_P21 Input Filer Status **/
#define PIOE_IFSR_P21		(1 << 21)
/** PIOE_IFSR_P20 Input Filer Status **/
#define PIOE_IFSR_P20		(1 << 20)
/** PIOE_IFSR_P19 Input Filer Status **/
#define PIOE_IFSR_P19		(1 << 19)
/** PIOE_IFSR_P18 Input Filer Status **/
#define PIOE_IFSR_P18		(1 << 18)
/** PIOE_IFSR_P17 Input Filer Status **/
#define PIOE_IFSR_P17		(1 << 17)
/** PIOE_IFSR_P16 Input Filer Status **/
#define PIOE_IFSR_P16		(1 << 16)
/** PIOE_IFSR_P15 Input Filer Status **/
#define PIOE_IFSR_P15		(1 << 15)
/** PIOE_IFSR_P14 Input Filer Status **/
#define PIOE_IFSR_P14		(1 << 14)
/** PIOE_IFSR_P13 Input Filer Status **/
#define PIOE_IFSR_P13		(1 << 13)
/** PIOE_IFSR_P12 Input Filer Status **/
#define PIOE_IFSR_P12		(1 << 12)
/** PIOE_IFSR_P11 Input Filer Status **/
#define PIOE_IFSR_P11		(1 << 11)
/** PIOE_IFSR_P10 Input Filer Status **/
#define PIOE_IFSR_P10		(1 << 10)
/** PIOE_IFSR_P9 Input Filer Status **/
#define PIOE_IFSR_P9		(1 << 9)
/** PIOE_IFSR_P8 Input Filer Status **/
#define PIOE_IFSR_P8		(1 << 8)
/** PIOE_IFSR_P7 Input Filer Status **/
#define PIOE_IFSR_P7		(1 << 7)
/** PIOE_IFSR_P6 Input Filer Status **/
#define PIOE_IFSR_P6		(1 << 6)
/** PIOE_IFSR_P5 Input Filer Status **/
#define PIOE_IFSR_P5		(1 << 5)
/** PIOE_IFSR_P4 Input Filer Status **/
#define PIOE_IFSR_P4		(1 << 4)
/** PIOE_IFSR_P3 Input Filer Status **/
#define PIOE_IFSR_P3		(1 << 3)
/** PIOE_IFSR_P2 Input Filer Status **/
#define PIOE_IFSR_P2		(1 << 2)
/** PIOE_IFSR_P1 Input Filer Status **/
#define PIOE_IFSR_P1		(1 << 1)
/** PIOE_IFSR_P0 Input Filer Status **/
#define PIOE_IFSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_sodr SODR Set Output Data Register
@{*/

/** PIOE_SODR_P31 Set Output Data **/
#define PIOE_SODR_P31		(1 << 31)
/** PIOE_SODR_P30 Set Output Data **/
#define PIOE_SODR_P30		(1 << 30)
/** PIOE_SODR_P29 Set Output Data **/
#define PIOE_SODR_P29		(1 << 29)
/** PIOE_SODR_P28 Set Output Data **/
#define PIOE_SODR_P28		(1 << 28)
/** PIOE_SODR_P27 Set Output Data **/
#define PIOE_SODR_P27		(1 << 27)
/** PIOE_SODR_P26 Set Output Data **/
#define PIOE_SODR_P26		(1 << 26)
/** PIOE_SODR_P25 Set Output Data **/
#define PIOE_SODR_P25		(1 << 25)
/** PIOE_SODR_P24 Set Output Data **/
#define PIOE_SODR_P24		(1 << 24)
/** PIOE_SODR_P23 Set Output Data **/
#define PIOE_SODR_P23		(1 << 23)
/** PIOE_SODR_P22 Set Output Data **/
#define PIOE_SODR_P22		(1 << 22)
/** PIOE_SODR_P21 Set Output Data **/
#define PIOE_SODR_P21		(1 << 21)
/** PIOE_SODR_P20 Set Output Data **/
#define PIOE_SODR_P20		(1 << 20)
/** PIOE_SODR_P19 Set Output Data **/
#define PIOE_SODR_P19		(1 << 19)
/** PIOE_SODR_P18 Set Output Data **/
#define PIOE_SODR_P18		(1 << 18)
/** PIOE_SODR_P17 Set Output Data **/
#define PIOE_SODR_P17		(1 << 17)
/** PIOE_SODR_P16 Set Output Data **/
#define PIOE_SODR_P16		(1 << 16)
/** PIOE_SODR_P15 Set Output Data **/
#define PIOE_SODR_P15		(1 << 15)
/** PIOE_SODR_P14 Set Output Data **/
#define PIOE_SODR_P14		(1 << 14)
/** PIOE_SODR_P13 Set Output Data **/
#define PIOE_SODR_P13		(1 << 13)
/** PIOE_SODR_P12 Set Output Data **/
#define PIOE_SODR_P12		(1 << 12)
/** PIOE_SODR_P11 Set Output Data **/
#define PIOE_SODR_P11		(1 << 11)
/** PIOE_SODR_P10 Set Output Data **/
#define PIOE_SODR_P10		(1 << 10)
/** PIOE_SODR_P9 Set Output Data **/
#define PIOE_SODR_P9		(1 << 9)
/** PIOE_SODR_P8 Set Output Data **/
#define PIOE_SODR_P8		(1 << 8)
/** PIOE_SODR_P7 Set Output Data **/
#define PIOE_SODR_P7		(1 << 7)
/** PIOE_SODR_P6 Set Output Data **/
#define PIOE_SODR_P6		(1 << 6)
/** PIOE_SODR_P5 Set Output Data **/
#define PIOE_SODR_P5		(1 << 5)
/** PIOE_SODR_P4 Set Output Data **/
#define PIOE_SODR_P4		(1 << 4)
/** PIOE_SODR_P3 Set Output Data **/
#define PIOE_SODR_P3		(1 << 3)
/** PIOE_SODR_P2 Set Output Data **/
#define PIOE_SODR_P2		(1 << 2)
/** PIOE_SODR_P1 Set Output Data **/
#define PIOE_SODR_P1		(1 << 1)
/** PIOE_SODR_P0 Set Output Data **/
#define PIOE_SODR_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_codr CODR Clear Output Data Register
@{*/

/** PIOE_CODR_P31 Clear Output Data **/
#define PIOE_CODR_P31		(1 << 31)
/** PIOE_CODR_P30 Clear Output Data **/
#define PIOE_CODR_P30		(1 << 30)
/** PIOE_CODR_P29 Clear Output Data **/
#define PIOE_CODR_P29		(1 << 29)
/** PIOE_CODR_P28 Clear Output Data **/
#define PIOE_CODR_P28		(1 << 28)
/** PIOE_CODR_P27 Clear Output Data **/
#define PIOE_CODR_P27		(1 << 27)
/** PIOE_CODR_P26 Clear Output Data **/
#define PIOE_CODR_P26		(1 << 26)
/** PIOE_CODR_P25 Clear Output Data **/
#define PIOE_CODR_P25		(1 << 25)
/** PIOE_CODR_P24 Clear Output Data **/
#define PIOE_CODR_P24		(1 << 24)
/** PIOE_CODR_P23 Clear Output Data **/
#define PIOE_CODR_P23		(1 << 23)
/** PIOE_CODR_P22 Clear Output Data **/
#define PIOE_CODR_P22		(1 << 22)
/** PIOE_CODR_P21 Clear Output Data **/
#define PIOE_CODR_P21		(1 << 21)
/** PIOE_CODR_P20 Clear Output Data **/
#define PIOE_CODR_P20		(1 << 20)
/** PIOE_CODR_P19 Clear Output Data **/
#define PIOE_CODR_P19		(1 << 19)
/** PIOE_CODR_P18 Clear Output Data **/
#define PIOE_CODR_P18		(1 << 18)
/** PIOE_CODR_P17 Clear Output Data **/
#define PIOE_CODR_P17		(1 << 17)
/** PIOE_CODR_P16 Clear Output Data **/
#define PIOE_CODR_P16		(1 << 16)
/** PIOE_CODR_P15 Clear Output Data **/
#define PIOE_CODR_P15		(1 << 15)
/** PIOE_CODR_P14 Clear Output Data **/
#define PIOE_CODR_P14		(1 << 14)
/** PIOE_CODR_P13 Clear Output Data **/
#define PIOE_CODR_P13		(1 << 13)
/** PIOE_CODR_P12 Clear Output Data **/
#define PIOE_CODR_P12		(1 << 12)
/** PIOE_CODR_P11 Clear Output Data **/
#define PIOE_CODR_P11		(1 << 11)
/** PIOE_CODR_P10 Clear Output Data **/
#define PIOE_CODR_P10		(1 << 10)
/** PIOE_CODR_P9 Clear Output Data **/
#define PIOE_CODR_P9		(1 << 9)
/** PIOE_CODR_P8 Clear Output Data **/
#define PIOE_CODR_P8		(1 << 8)
/** PIOE_CODR_P7 Clear Output Data **/
#define PIOE_CODR_P7		(1 << 7)
/** PIOE_CODR_P6 Clear Output Data **/
#define PIOE_CODR_P6		(1 << 6)
/** PIOE_CODR_P5 Clear Output Data **/
#define PIOE_CODR_P5		(1 << 5)
/** PIOE_CODR_P4 Clear Output Data **/
#define PIOE_CODR_P4		(1 << 4)
/** PIOE_CODR_P3 Clear Output Data **/
#define PIOE_CODR_P3		(1 << 3)
/** PIOE_CODR_P2 Clear Output Data **/
#define PIOE_CODR_P2		(1 << 2)
/** PIOE_CODR_P1 Clear Output Data **/
#define PIOE_CODR_P1		(1 << 1)
/** PIOE_CODR_P0 Clear Output Data **/
#define PIOE_CODR_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_odsr ODSR Output Data Status Register
@{*/

/** PIOE_ODSR_P31 Output Data Status **/
#define PIOE_ODSR_P31		(1 << 31)
/** PIOE_ODSR_P30 Output Data Status **/
#define PIOE_ODSR_P30		(1 << 30)
/** PIOE_ODSR_P29 Output Data Status **/
#define PIOE_ODSR_P29		(1 << 29)
/** PIOE_ODSR_P28 Output Data Status **/
#define PIOE_ODSR_P28		(1 << 28)
/** PIOE_ODSR_P27 Output Data Status **/
#define PIOE_ODSR_P27		(1 << 27)
/** PIOE_ODSR_P26 Output Data Status **/
#define PIOE_ODSR_P26		(1 << 26)
/** PIOE_ODSR_P25 Output Data Status **/
#define PIOE_ODSR_P25		(1 << 25)
/** PIOE_ODSR_P24 Output Data Status **/
#define PIOE_ODSR_P24		(1 << 24)
/** PIOE_ODSR_P23 Output Data Status **/
#define PIOE_ODSR_P23		(1 << 23)
/** PIOE_ODSR_P22 Output Data Status **/
#define PIOE_ODSR_P22		(1 << 22)
/** PIOE_ODSR_P21 Output Data Status **/
#define PIOE_ODSR_P21		(1 << 21)
/** PIOE_ODSR_P20 Output Data Status **/
#define PIOE_ODSR_P20		(1 << 20)
/** PIOE_ODSR_P19 Output Data Status **/
#define PIOE_ODSR_P19		(1 << 19)
/** PIOE_ODSR_P18 Output Data Status **/
#define PIOE_ODSR_P18		(1 << 18)
/** PIOE_ODSR_P17 Output Data Status **/
#define PIOE_ODSR_P17		(1 << 17)
/** PIOE_ODSR_P16 Output Data Status **/
#define PIOE_ODSR_P16		(1 << 16)
/** PIOE_ODSR_P15 Output Data Status **/
#define PIOE_ODSR_P15		(1 << 15)
/** PIOE_ODSR_P14 Output Data Status **/
#define PIOE_ODSR_P14		(1 << 14)
/** PIOE_ODSR_P13 Output Data Status **/
#define PIOE_ODSR_P13		(1 << 13)
/** PIOE_ODSR_P12 Output Data Status **/
#define PIOE_ODSR_P12		(1 << 12)
/** PIOE_ODSR_P11 Output Data Status **/
#define PIOE_ODSR_P11		(1 << 11)
/** PIOE_ODSR_P10 Output Data Status **/
#define PIOE_ODSR_P10		(1 << 10)
/** PIOE_ODSR_P9 Output Data Status **/
#define PIOE_ODSR_P9		(1 << 9)
/** PIOE_ODSR_P8 Output Data Status **/
#define PIOE_ODSR_P8		(1 << 8)
/** PIOE_ODSR_P7 Output Data Status **/
#define PIOE_ODSR_P7		(1 << 7)
/** PIOE_ODSR_P6 Output Data Status **/
#define PIOE_ODSR_P6		(1 << 6)
/** PIOE_ODSR_P5 Output Data Status **/
#define PIOE_ODSR_P5		(1 << 5)
/** PIOE_ODSR_P4 Output Data Status **/
#define PIOE_ODSR_P4		(1 << 4)
/** PIOE_ODSR_P3 Output Data Status **/
#define PIOE_ODSR_P3		(1 << 3)
/** PIOE_ODSR_P2 Output Data Status **/
#define PIOE_ODSR_P2		(1 << 2)
/** PIOE_ODSR_P1 Output Data Status **/
#define PIOE_ODSR_P1		(1 << 1)
/** PIOE_ODSR_P0 Output Data Status **/
#define PIOE_ODSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_pdsr PDSR Pin Data Status Register
@{*/

