grevaillot/svd_tools/headers/ATSAM3X8H/pioe.h
/** @defgroup pioe_isr ISR Interrupt Status Register
@{*/

/** PIOE_ISR_P31 Input Change Interrupt Status **/
#define PIOE_ISR_P31		(1 << 31)
/** PIOE_ISR_P30 Input Change Interrupt Status **/
#define PIOE_ISR_P30		(1 << 30)
/** PIOE_ISR_P29 Input Change Interrupt Status **/
#define PIOE_ISR_P29		(1 << 29)
/** PIOE_ISR_P28 Input Change Interrupt Status **/
#define PIOE_ISR_P28		(1 << 28)
/** PIOE_ISR_P27 Input Change Interrupt Status **/
#define PIOE_ISR_P27		(1 << 27)
/** PIOE_ISR_P26 Input Change Interrupt Status **/
#define PIOE_ISR_P26		(1 << 26)
/** PIOE_ISR_P25 Input Change Interrupt Status **/
#define PIOE_ISR_P25		(1 << 25)
/** PIOE_ISR_P24 Input Change Interrupt Status **/
#define PIOE_ISR_P24		(1 << 24)
/** PIOE_ISR_P23 Input Change Interrupt Status **/
#define PIOE_ISR_P23		(1 << 23)
/** PIOE_ISR_P22 Input Change Interrupt Status **/
#define PIOE_ISR_P22		(1 << 22)
/** PIOE_ISR_P21 Input Change Interrupt Status **/
#define PIOE_ISR_P21		(1 << 21)
/** PIOE_ISR_P20 Input Change Interrupt Status **/
#define PIOE_ISR_P20		(1 << 20)
/** PIOE_ISR_P19 Input Change Interrupt Status **/
#define PIOE_ISR_P19		(1 << 19)
/** PIOE_ISR_P18 Input Change Interrupt Status **/
#define PIOE_ISR_P18		(1 << 18)
/** PIOE_ISR_P17 Input Change Interrupt Status **/
#define PIOE_ISR_P17		(1 << 17)
/** PIOE_ISR_P16 Input Change Interrupt Status **/
#define PIOE_ISR_P16		(1 << 16)
/** PIOE_ISR_P15 Input Change Interrupt Status **/
#define PIOE_ISR_P15		(1 << 15)
/** PIOE_ISR_P14 Input Change Interrupt Status **/
#define PIOE_ISR_P14		(1 << 14)
/** PIOE_ISR_P13 Input Change Interrupt Status **/
#define PIOE_ISR_P13		(1 << 13)
/** PIOE_ISR_P12 Input Change Interrupt Status **/
#define PIOE_ISR_P12		(1 << 12)
/** PIOE_ISR_P11 Input Change Interrupt Status **/
#define PIOE_ISR_P11		(1 << 11)
/** PIOE_ISR_P10 Input Change Interrupt Status **/
#define PIOE_ISR_P10		(1 << 10)
/** PIOE_ISR_P9 Input Change Interrupt Status **/
#define PIOE_ISR_P9		(1 << 9)
/** PIOE_ISR_P8 Input Change Interrupt Status **/
#define PIOE_ISR_P8		(1 << 8)
/** PIOE_ISR_P7 Input Change Interrupt Status **/
#define PIOE_ISR_P7		(1 << 7)
/** PIOE_ISR_P6 Input Change Interrupt Status **/
#define PIOE_ISR_P6		(1 << 6)
/** PIOE_ISR_P5 Input Change Interrupt Status **/
#define PIOE_ISR_P5		(1 << 5)
/** PIOE_ISR_P4 Input Change Interrupt Status **/
#define PIOE_ISR_P4		(1 << 4)
/** PIOE_ISR_P3 Input Change Interrupt Status **/
#define PIOE_ISR_P3		(1 << 3)
/** PIOE_ISR_P2 Input Change Interrupt Status **/
#define PIOE_ISR_P2		(1 << 2)
/** PIOE_ISR_P1 Input Change Interrupt Status **/
#define PIOE_ISR_P1		(1 << 1)
/** PIOE_ISR_P0 Input Change Interrupt Status **/
#define PIOE_ISR_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_mder MDER Multi-driver Enable Register
@{*/

/** PIOE_MDER_P31 Multi Drive Enable. **/
#define PIOE_MDER_P31		(1 << 31)
/** PIOE_MDER_P30 Multi Drive Enable. **/
#define PIOE_MDER_P30		(1 << 30)
/** PIOE_MDER_P29 Multi Drive Enable. **/
#define PIOE_MDER_P29		(1 << 29)
/** PIOE_MDER_P28 Multi Drive Enable. **/
#define PIOE_MDER_P28		(1 << 28)
/** PIOE_MDER_P27 Multi Drive Enable. **/
#define PIOE_MDER_P27		(1 << 27)
/** PIOE_MDER_P26 Multi Drive Enable. **/
#define PIOE_MDER_P26		(1 << 26)
/** PIOE_MDER_P25 Multi Drive Enable. **/
#define PIOE_MDER_P25		(1 << 25)
/** PIOE_MDER_P24 Multi Drive Enable. **/
#define PIOE_MDER_P24		(1 << 24)
/** PIOE_MDER_P23 Multi Drive Enable. **/
#define PIOE_MDER_P23		(1 << 23)
/** PIOE_MDER_P22 Multi Drive Enable. **/
#define PIOE_MDER_P22		(1 << 22)
/** PIOE_MDER_P21 Multi Drive Enable. **/
#define PIOE_MDER_P21		(1 << 21)
/** PIOE_MDER_P20 Multi Drive Enable. **/
#define PIOE_MDER_P20		(1 << 20)
/** PIOE_MDER_P19 Multi Drive Enable. **/
#define PIOE_MDER_P19		(1 << 19)
/** PIOE_MDER_P18 Multi Drive Enable. **/
#define PIOE_MDER_P18		(1 << 18)
/** PIOE_MDER_P17 Multi Drive Enable. **/
#define PIOE_MDER_P17		(1 << 17)
/** PIOE_MDER_P16 Multi Drive Enable. **/
#define PIOE_MDER_P16		(1 << 16)
/** PIOE_MDER_P15 Multi Drive Enable. **/
#define PIOE_MDER_P15		(1 << 15)
/** PIOE_MDER_P14 Multi Drive Enable. **/
#define PIOE_MDER_P14		(1 << 14)
/** PIOE_MDER_P13 Multi Drive Enable. **/
#define PIOE_MDER_P13		(1 << 13)
/** PIOE_MDER_P12 Multi Drive Enable. **/
#define PIOE_MDER_P12		(1 << 12)
/** PIOE_MDER_P11 Multi Drive Enable. **/
#define PIOE_MDER_P11		(1 << 11)
/** PIOE_MDER_P10 Multi Drive Enable. **/
#define PIOE_MDER_P10		(1 << 10)
/** PIOE_MDER_P9 Multi Drive Enable. **/
#define PIOE_MDER_P9		(1 << 9)
/** PIOE_MDER_P8 Multi Drive Enable. **/
#define PIOE_MDER_P8		(1 << 8)
/** PIOE_MDER_P7 Multi Drive Enable. **/
#define PIOE_MDER_P7		(1 << 7)
/** PIOE_MDER_P6 Multi Drive Enable. **/
#define PIOE_MDER_P6		(1 << 6)
/** PIOE_MDER_P5 Multi Drive Enable. **/
#define PIOE_MDER_P5		(1 << 5)
/** PIOE_MDER_P4 Multi Drive Enable. **/
#define PIOE_MDER_P4		(1 << 4)
/** PIOE_MDER_P3 Multi Drive Enable. **/
#define PIOE_MDER_P3		(1 << 3)
/** PIOE_MDER_P2 Multi Drive Enable. **/
#define PIOE_MDER_P2		(1 << 2)
/** PIOE_MDER_P1 Multi Drive Enable. **/
#define PIOE_MDER_P1		(1 << 1)
/** PIOE_MDER_P0 Multi Drive Enable. **/
#define PIOE_MDER_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_mddr MDDR Multi-driver Disable Register
@{*/

/** PIOE_MDDR_P31 Multi Drive Disable. **/
#define PIOE_MDDR_P31		(1 << 31)
/** PIOE_MDDR_P30 Multi Drive Disable. **/
#define PIOE_MDDR_P30		(1 << 30)
/** PIOE_MDDR_P29 Multi Drive Disable. **/
#define PIOE_MDDR_P29		(1 << 29)
/** PIOE_MDDR_P28 Multi Drive Disable. **/
#define PIOE_MDDR_P28		(1 << 28)
/** PIOE_MDDR_P27 Multi Drive Disable. **/
#define PIOE_MDDR_P27		(1 << 27)
/** PIOE_MDDR_P26 Multi Drive Disable. **/
#define PIOE_MDDR_P26		(1 << 26)
/** PIOE_MDDR_P25 Multi Drive Disable. **/
#define PIOE_MDDR_P25		(1 << 25)
/** PIOE_MDDR_P24 Multi Drive Disable. **/
#define PIOE_MDDR_P24		(1 << 24)
/** PIOE_MDDR_P23 Multi Drive Disable. **/
#define PIOE_MDDR_P23		(1 << 23)
/** PIOE_MDDR_P22 Multi Drive Disable. **/
#define PIOE_MDDR_P22		(1 << 22)
/** PIOE_MDDR_P21 Multi Drive Disable. **/
#define PIOE_MDDR_P21		(1 << 21)
/** PIOE_MDDR_P20 Multi Drive Disable. **/
#define PIOE_MDDR_P20		(1 << 20)
/** PIOE_MDDR_P19 Multi Drive Disable. **/
#define PIOE_MDDR_P19		(1 << 19)
/** PIOE_MDDR_P18 Multi Drive Disable. **/
#define PIOE_MDDR_P18		(1 << 18)
/** PIOE_MDDR_P17 Multi Drive Disable. **/
#define PIOE_MDDR_P17		(1 << 17)
/** PIOE_MDDR_P16 Multi Drive Disable. **/
#define PIOE_MDDR_P16		(1 << 16)
/** PIOE_MDDR_P15 Multi Drive Disable. **/
#define PIOE_MDDR_P15		(1 << 15)
/** PIOE_MDDR_P14 Multi Drive Disable. **/
#define PIOE_MDDR_P14		(1 << 14)
/** PIOE_MDDR_P13 Multi Drive Disable. **/
#define PIOE_MDDR_P13		(1 << 13)
/** PIOE_MDDR_P12 Multi Drive Disable. **/
#define PIOE_MDDR_P12		(1 << 12)
/** PIOE_MDDR_P11 Multi Drive Disable. **/
#define PIOE_MDDR_P11		(1 << 11)
/** PIOE_MDDR_P10 Multi Drive Disable. **/
#define PIOE_MDDR_P10		(1 << 10)
/** PIOE_MDDR_P9 Multi Drive Disable. **/
#define PIOE_MDDR_P9		(1 << 9)
/** PIOE_MDDR_P8 Multi Drive Disable. **/
#define PIOE_MDDR_P8		(1 << 8)
/** PIOE_MDDR_P7 Multi Drive Disable. **/
#define PIOE_MDDR_P7		(1 << 7)
/** PIOE_MDDR_P6 Multi Drive Disable. **/
#define PIOE_MDDR_P6		(1 << 6)
/** PIOE_MDDR_P5 Multi Drive Disable. **/
#define PIOE_MDDR_P5		(1 << 5)
/** PIOE_MDDR_P4 Multi Drive Disable. **/
#define PIOE_MDDR_P4		(1 << 4)
/** PIOE_MDDR_P3 Multi Drive Disable. **/
#define PIOE_MDDR_P3		(1 << 3)
/** PIOE_MDDR_P2 Multi Drive Disable. **/
#define PIOE_MDDR_P2		(1 << 2)
/** PIOE_MDDR_P1 Multi Drive Disable. **/
#define PIOE_MDDR_P1		(1 << 1)
/** PIOE_MDDR_P0 Multi Drive Disable. **/
#define PIOE_MDDR_P0		(1 << 0)

/**@}*/

