grevaillot/svd_tools/headers/ATSAM3X8H/pioe.h
/** @defgroup pioe_mdsr MDSR Multi-driver Status Register
@{*/

/** PIOE_MDSR_P31 Multi Drive Status. **/
#define PIOE_MDSR_P31		(1 << 31)
/** PIOE_MDSR_P30 Multi Drive Status. **/
#define PIOE_MDSR_P30		(1 << 30)
/** PIOE_MDSR_P29 Multi Drive Status. **/
#define PIOE_MDSR_P29		(1 << 29)
/** PIOE_MDSR_P28 Multi Drive Status. **/
#define PIOE_MDSR_P28		(1 << 28)
/** PIOE_MDSR_P27 Multi Drive Status. **/
#define PIOE_MDSR_P27		(1 << 27)
/** PIOE_MDSR_P26 Multi Drive Status. **/
#define PIOE_MDSR_P26		(1 << 26)
/** PIOE_MDSR_P25 Multi Drive Status. **/
#define PIOE_MDSR_P25		(1 << 25)
/** PIOE_MDSR_P24 Multi Drive Status. **/
#define PIOE_MDSR_P24		(1 << 24)
/** PIOE_MDSR_P23 Multi Drive Status. **/
#define PIOE_MDSR_P23		(1 << 23)
/** PIOE_MDSR_P22 Multi Drive Status. **/
#define PIOE_MDSR_P22		(1 << 22)
/** PIOE_MDSR_P21 Multi Drive Status. **/
#define PIOE_MDSR_P21		(1 << 21)
/** PIOE_MDSR_P20 Multi Drive Status. **/
#define PIOE_MDSR_P20		(1 << 20)
/** PIOE_MDSR_P19 Multi Drive Status. **/
#define PIOE_MDSR_P19		(1 << 19)
/** PIOE_MDSR_P18 Multi Drive Status. **/
#define PIOE_MDSR_P18		(1 << 18)
/** PIOE_MDSR_P17 Multi Drive Status. **/
#define PIOE_MDSR_P17		(1 << 17)
/** PIOE_MDSR_P16 Multi Drive Status. **/
#define PIOE_MDSR_P16		(1 << 16)
/** PIOE_MDSR_P15 Multi Drive Status. **/
#define PIOE_MDSR_P15		(1 << 15)
/** PIOE_MDSR_P14 Multi Drive Status. **/
#define PIOE_MDSR_P14		(1 << 14)
/** PIOE_MDSR_P13 Multi Drive Status. **/
#define PIOE_MDSR_P13		(1 << 13)
/** PIOE_MDSR_P12 Multi Drive Status. **/
#define PIOE_MDSR_P12		(1 << 12)
/** PIOE_MDSR_P11 Multi Drive Status. **/
#define PIOE_MDSR_P11		(1 << 11)
/** PIOE_MDSR_P10 Multi Drive Status. **/
#define PIOE_MDSR_P10		(1 << 10)
/** PIOE_MDSR_P9 Multi Drive Status. **/
#define PIOE_MDSR_P9		(1 << 9)
/** PIOE_MDSR_P8 Multi Drive Status. **/
#define PIOE_MDSR_P8		(1 << 8)
/** PIOE_MDSR_P7 Multi Drive Status. **/
#define PIOE_MDSR_P7		(1 << 7)
/** PIOE_MDSR_P6 Multi Drive Status. **/
#define PIOE_MDSR_P6		(1 << 6)
/** PIOE_MDSR_P5 Multi Drive Status. **/
#define PIOE_MDSR_P5		(1 << 5)
/** PIOE_MDSR_P4 Multi Drive Status. **/
#define PIOE_MDSR_P4		(1 << 4)
/** PIOE_MDSR_P3 Multi Drive Status. **/
#define PIOE_MDSR_P3		(1 << 3)
/** PIOE_MDSR_P2 Multi Drive Status. **/
#define PIOE_MDSR_P2		(1 << 2)
/** PIOE_MDSR_P1 Multi Drive Status. **/
#define PIOE_MDSR_P1		(1 << 1)
/** PIOE_MDSR_P0 Multi Drive Status. **/
#define PIOE_MDSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_pudr PUDR Pull-up Disable Register
@{*/

/** PIOE_PUDR_P31 Pull Up Disable. **/
#define PIOE_PUDR_P31		(1 << 31)
/** PIOE_PUDR_P30 Pull Up Disable. **/
#define PIOE_PUDR_P30		(1 << 30)
/** PIOE_PUDR_P29 Pull Up Disable. **/
#define PIOE_PUDR_P29		(1 << 29)
/** PIOE_PUDR_P28 Pull Up Disable. **/
#define PIOE_PUDR_P28		(1 << 28)
/** PIOE_PUDR_P27 Pull Up Disable. **/
#define PIOE_PUDR_P27		(1 << 27)
/** PIOE_PUDR_P26 Pull Up Disable. **/
#define PIOE_PUDR_P26		(1 << 26)
/** PIOE_PUDR_P25 Pull Up Disable. **/
#define PIOE_PUDR_P25		(1 << 25)
/** PIOE_PUDR_P24 Pull Up Disable. **/
#define PIOE_PUDR_P24		(1 << 24)
/** PIOE_PUDR_P23 Pull Up Disable. **/
#define PIOE_PUDR_P23		(1 << 23)
/** PIOE_PUDR_P22 Pull Up Disable. **/
#define PIOE_PUDR_P22		(1 << 22)
/** PIOE_PUDR_P21 Pull Up Disable. **/
#define PIOE_PUDR_P21		(1 << 21)
/** PIOE_PUDR_P20 Pull Up Disable. **/
#define PIOE_PUDR_P20		(1 << 20)
/** PIOE_PUDR_P19 Pull Up Disable. **/
#define PIOE_PUDR_P19		(1 << 19)
/** PIOE_PUDR_P18 Pull Up Disable. **/
#define PIOE_PUDR_P18		(1 << 18)
/** PIOE_PUDR_P17 Pull Up Disable. **/
#define PIOE_PUDR_P17		(1 << 17)
/** PIOE_PUDR_P16 Pull Up Disable. **/
#define PIOE_PUDR_P16		(1 << 16)
/** PIOE_PUDR_P15 Pull Up Disable. **/
#define PIOE_PUDR_P15		(1 << 15)
/** PIOE_PUDR_P14 Pull Up Disable. **/
#define PIOE_PUDR_P14		(1 << 14)
/** PIOE_PUDR_P13 Pull Up Disable. **/
#define PIOE_PUDR_P13		(1 << 13)
/** PIOE_PUDR_P12 Pull Up Disable. **/
#define PIOE_PUDR_P12		(1 << 12)
/** PIOE_PUDR_P11 Pull Up Disable. **/
#define PIOE_PUDR_P11		(1 << 11)
/** PIOE_PUDR_P10 Pull Up Disable. **/
#define PIOE_PUDR_P10		(1 << 10)
/** PIOE_PUDR_P9 Pull Up Disable. **/
#define PIOE_PUDR_P9		(1 << 9)
/** PIOE_PUDR_P8 Pull Up Disable. **/
#define PIOE_PUDR_P8		(1 << 8)
/** PIOE_PUDR_P7 Pull Up Disable. **/
#define PIOE_PUDR_P7		(1 << 7)
/** PIOE_PUDR_P6 Pull Up Disable. **/
#define PIOE_PUDR_P6		(1 << 6)
/** PIOE_PUDR_P5 Pull Up Disable. **/
#define PIOE_PUDR_P5		(1 << 5)
/** PIOE_PUDR_P4 Pull Up Disable. **/
#define PIOE_PUDR_P4		(1 << 4)
/** PIOE_PUDR_P3 Pull Up Disable. **/
#define PIOE_PUDR_P3		(1 << 3)
/** PIOE_PUDR_P2 Pull Up Disable. **/
#define PIOE_PUDR_P2		(1 << 2)
/** PIOE_PUDR_P1 Pull Up Disable. **/
#define PIOE_PUDR_P1		(1 << 1)
/** PIOE_PUDR_P0 Pull Up Disable. **/
#define PIOE_PUDR_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_puer PUER Pull-up Enable Register
@{*/

/** PIOE_PUER_P31 Pull Up Enable. **/
#define PIOE_PUER_P31		(1 << 31)
/** PIOE_PUER_P30 Pull Up Enable. **/
#define PIOE_PUER_P30		(1 << 30)
/** PIOE_PUER_P29 Pull Up Enable. **/
#define PIOE_PUER_P29		(1 << 29)
/** PIOE_PUER_P28 Pull Up Enable. **/
#define PIOE_PUER_P28		(1 << 28)
/** PIOE_PUER_P27 Pull Up Enable. **/
#define PIOE_PUER_P27		(1 << 27)
/** PIOE_PUER_P26 Pull Up Enable. **/
#define PIOE_PUER_P26		(1 << 26)
/** PIOE_PUER_P25 Pull Up Enable. **/
#define PIOE_PUER_P25		(1 << 25)
/** PIOE_PUER_P24 Pull Up Enable. **/
#define PIOE_PUER_P24		(1 << 24)
/** PIOE_PUER_P23 Pull Up Enable. **/
#define PIOE_PUER_P23		(1 << 23)
/** PIOE_PUER_P22 Pull Up Enable. **/
#define PIOE_PUER_P22		(1 << 22)
/** PIOE_PUER_P21 Pull Up Enable. **/
#define PIOE_PUER_P21		(1 << 21)
/** PIOE_PUER_P20 Pull Up Enable. **/
#define PIOE_PUER_P20		(1 << 20)
/** PIOE_PUER_P19 Pull Up Enable. **/
#define PIOE_PUER_P19		(1 << 19)
/** PIOE_PUER_P18 Pull Up Enable. **/
#define PIOE_PUER_P18		(1 << 18)
/** PIOE_PUER_P17 Pull Up Enable. **/
#define PIOE_PUER_P17		(1 << 17)
/** PIOE_PUER_P16 Pull Up Enable. **/
#define PIOE_PUER_P16		(1 << 16)
/** PIOE_PUER_P15 Pull Up Enable. **/
#define PIOE_PUER_P15		(1 << 15)
/** PIOE_PUER_P14 Pull Up Enable. **/
#define PIOE_PUER_P14		(1 << 14)
/** PIOE_PUER_P13 Pull Up Enable. **/
#define PIOE_PUER_P13		(1 << 13)
/** PIOE_PUER_P12 Pull Up Enable. **/
#define PIOE_PUER_P12		(1 << 12)
/** PIOE_PUER_P11 Pull Up Enable. **/
#define PIOE_PUER_P11		(1 << 11)
/** PIOE_PUER_P10 Pull Up Enable. **/
#define PIOE_PUER_P10		(1 << 10)
/** PIOE_PUER_P9 Pull Up Enable. **/
#define PIOE_PUER_P9		(1 << 9)
/** PIOE_PUER_P8 Pull Up Enable. **/
#define PIOE_PUER_P8		(1 << 8)
/** PIOE_PUER_P7 Pull Up Enable. **/
#define PIOE_PUER_P7		(1 << 7)
/** PIOE_PUER_P6 Pull Up Enable. **/
#define PIOE_PUER_P6		(1 << 6)
/** PIOE_PUER_P5 Pull Up Enable. **/
#define PIOE_PUER_P5		(1 << 5)
/** PIOE_PUER_P4 Pull Up Enable. **/
#define PIOE_PUER_P4		(1 << 4)
/** PIOE_PUER_P3 Pull Up Enable. **/
#define PIOE_PUER_P3		(1 << 3)
/** PIOE_PUER_P2 Pull Up Enable. **/
#define PIOE_PUER_P2		(1 << 2)
/** PIOE_PUER_P1 Pull Up Enable. **/
#define PIOE_PUER_P1		(1 << 1)
/** PIOE_PUER_P0 Pull Up Enable. **/
#define PIOE_PUER_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_pusr PUSR Pad Pull-up Status Register
@{*/

/** PIOE_PUSR_P31 Pull Up Status. **/
#define PIOE_PUSR_P31		(1 << 31)
/** PIOE_PUSR_P30 Pull Up Status. **/
#define PIOE_PUSR_P30		(1 << 30)
/** PIOE_PUSR_P29 Pull Up Status. **/
#define PIOE_PUSR_P29		(1 << 29)
/** PIOE_PUSR_P28 Pull Up Status. **/
#define PIOE_PUSR_P28		(1 << 28)
/** PIOE_PUSR_P27 Pull Up Status. **/
#define PIOE_PUSR_P27		(1 << 27)
/** PIOE_PUSR_P26 Pull Up Status. **/
#define PIOE_PUSR_P26		(1 << 26)
/** PIOE_PUSR_P25 Pull Up Status. **/
#define PIOE_PUSR_P25		(1 << 25)
/** PIOE_PUSR_P24 Pull Up Status. **/
#define PIOE_PUSR_P24		(1 << 24)
/** PIOE_PUSR_P23 Pull Up Status. **/
#define PIOE_PUSR_P23		(1 << 23)
/** PIOE_PUSR_P22 Pull Up Status. **/
#define PIOE_PUSR_P22		(1 << 22)
/** PIOE_PUSR_P21 Pull Up Status. **/
#define PIOE_PUSR_P21		(1 << 21)
/** PIOE_PUSR_P20 Pull Up Status. **/
#define PIOE_PUSR_P20		(1 << 20)
/** PIOE_PUSR_P19 Pull Up Status. **/
#define PIOE_PUSR_P19		(1 << 19)
/** PIOE_PUSR_P18 Pull Up Status. **/
#define PIOE_PUSR_P18		(1 << 18)
/** PIOE_PUSR_P17 Pull Up Status. **/
#define PIOE_PUSR_P17		(1 << 17)
/** PIOE_PUSR_P16 Pull Up Status. **/
#define PIOE_PUSR_P16		(1 << 16)
/** PIOE_PUSR_P15 Pull Up Status. **/
#define PIOE_PUSR_P15		(1 << 15)
/** PIOE_PUSR_P14 Pull Up Status. **/
#define PIOE_PUSR_P14		(1 << 14)
/** PIOE_PUSR_P13 Pull Up Status. **/
#define PIOE_PUSR_P13		(1 << 13)
/** PIOE_PUSR_P12 Pull Up Status. **/
#define PIOE_PUSR_P12		(1 << 12)
/** PIOE_PUSR_P11 Pull Up Status. **/
#define PIOE_PUSR_P11		(1 << 11)
/** PIOE_PUSR_P10 Pull Up Status. **/
#define PIOE_PUSR_P10		(1 << 10)
/** PIOE_PUSR_P9 Pull Up Status. **/
#define PIOE_PUSR_P9		(1 << 9)
/** PIOE_PUSR_P8 Pull Up Status. **/
#define PIOE_PUSR_P8		(1 << 8)
/** PIOE_PUSR_P7 Pull Up Status. **/
#define PIOE_PUSR_P7		(1 << 7)
/** PIOE_PUSR_P6 Pull Up Status. **/
#define PIOE_PUSR_P6		(1 << 6)
/** PIOE_PUSR_P5 Pull Up Status. **/
#define PIOE_PUSR_P5		(1 << 5)
/** PIOE_PUSR_P4 Pull Up Status. **/
#define PIOE_PUSR_P4		(1 << 4)
/** PIOE_PUSR_P3 Pull Up Status. **/
#define PIOE_PUSR_P3		(1 << 3)
/** PIOE_PUSR_P2 Pull Up Status. **/
#define PIOE_PUSR_P2		(1 << 2)
/** PIOE_PUSR_P1 Pull Up Status. **/
#define PIOE_PUSR_P1		(1 << 1)
/** PIOE_PUSR_P0 Pull Up Status. **/
#define PIOE_PUSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_absr ABSR Peripheral AB Select Register
@{*/

