grevaillot/svd_tools/headers/ATSAM3X8H/pioe.h
/** @defgroup pioe_scdr SCDR Slow Clock Divider Debouncing Register
@{*/


#define PIOE_SCDR_DIV_SHIFT		0
#define PIOE_SCDR_DIV_MASK		0x3fff
/** @defgroup pioe_scdr_div DIV Slow Clock Divider Selection for Debouncing
@{*/
/**@}*/


/**@}*/

/** @defgroup pioe_ower OWER Output Write Enable
@{*/

/** PIOE_OWER_P31 Output Write Enable. **/
#define PIOE_OWER_P31		(1 << 31)
/** PIOE_OWER_P30 Output Write Enable. **/
#define PIOE_OWER_P30		(1 << 30)
/** PIOE_OWER_P29 Output Write Enable. **/
#define PIOE_OWER_P29		(1 << 29)
/** PIOE_OWER_P28 Output Write Enable. **/
#define PIOE_OWER_P28		(1 << 28)
/** PIOE_OWER_P27 Output Write Enable. **/
#define PIOE_OWER_P27		(1 << 27)
/** PIOE_OWER_P26 Output Write Enable. **/
#define PIOE_OWER_P26		(1 << 26)
/** PIOE_OWER_P25 Output Write Enable. **/
#define PIOE_OWER_P25		(1 << 25)
/** PIOE_OWER_P24 Output Write Enable. **/
#define PIOE_OWER_P24		(1 << 24)
/** PIOE_OWER_P23 Output Write Enable. **/
#define PIOE_OWER_P23		(1 << 23)
/** PIOE_OWER_P22 Output Write Enable. **/
#define PIOE_OWER_P22		(1 << 22)
/** PIOE_OWER_P21 Output Write Enable. **/
#define PIOE_OWER_P21		(1 << 21)
/** PIOE_OWER_P20 Output Write Enable. **/
#define PIOE_OWER_P20		(1 << 20)
/** PIOE_OWER_P19 Output Write Enable. **/
#define PIOE_OWER_P19		(1 << 19)
/** PIOE_OWER_P18 Output Write Enable. **/
#define PIOE_OWER_P18		(1 << 18)
/** PIOE_OWER_P17 Output Write Enable. **/
#define PIOE_OWER_P17		(1 << 17)
/** PIOE_OWER_P16 Output Write Enable. **/
#define PIOE_OWER_P16		(1 << 16)
/** PIOE_OWER_P15 Output Write Enable. **/
#define PIOE_OWER_P15		(1 << 15)
/** PIOE_OWER_P14 Output Write Enable. **/
#define PIOE_OWER_P14		(1 << 14)
/** PIOE_OWER_P13 Output Write Enable. **/
#define PIOE_OWER_P13		(1 << 13)
/** PIOE_OWER_P12 Output Write Enable. **/
#define PIOE_OWER_P12		(1 << 12)
/** PIOE_OWER_P11 Output Write Enable. **/
#define PIOE_OWER_P11		(1 << 11)
/** PIOE_OWER_P10 Output Write Enable. **/
#define PIOE_OWER_P10		(1 << 10)
/** PIOE_OWER_P9 Output Write Enable. **/
#define PIOE_OWER_P9		(1 << 9)
/** PIOE_OWER_P8 Output Write Enable. **/
#define PIOE_OWER_P8		(1 << 8)
/** PIOE_OWER_P7 Output Write Enable. **/
#define PIOE_OWER_P7		(1 << 7)
/** PIOE_OWER_P6 Output Write Enable. **/
#define PIOE_OWER_P6		(1 << 6)
/** PIOE_OWER_P5 Output Write Enable. **/
#define PIOE_OWER_P5		(1 << 5)
/** PIOE_OWER_P4 Output Write Enable. **/
#define PIOE_OWER_P4		(1 << 4)
/** PIOE_OWER_P3 Output Write Enable. **/
#define PIOE_OWER_P3		(1 << 3)
/** PIOE_OWER_P2 Output Write Enable. **/
#define PIOE_OWER_P2		(1 << 2)
/** PIOE_OWER_P1 Output Write Enable. **/
#define PIOE_OWER_P1		(1 << 1)
/** PIOE_OWER_P0 Output Write Enable. **/
#define PIOE_OWER_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_owdr OWDR Output Write Disable
@{*/

/** PIOE_OWDR_P31 Output Write Disable. **/
#define PIOE_OWDR_P31		(1 << 31)
/** PIOE_OWDR_P30 Output Write Disable. **/
#define PIOE_OWDR_P30		(1 << 30)
/** PIOE_OWDR_P29 Output Write Disable. **/
#define PIOE_OWDR_P29		(1 << 29)
/** PIOE_OWDR_P28 Output Write Disable. **/
#define PIOE_OWDR_P28		(1 << 28)
/** PIOE_OWDR_P27 Output Write Disable. **/
#define PIOE_OWDR_P27		(1 << 27)
/** PIOE_OWDR_P26 Output Write Disable. **/
#define PIOE_OWDR_P26		(1 << 26)
/** PIOE_OWDR_P25 Output Write Disable. **/
#define PIOE_OWDR_P25		(1 << 25)
/** PIOE_OWDR_P24 Output Write Disable. **/
#define PIOE_OWDR_P24		(1 << 24)
/** PIOE_OWDR_P23 Output Write Disable. **/
#define PIOE_OWDR_P23		(1 << 23)
/** PIOE_OWDR_P22 Output Write Disable. **/
#define PIOE_OWDR_P22		(1 << 22)
/** PIOE_OWDR_P21 Output Write Disable. **/
#define PIOE_OWDR_P21		(1 << 21)
/** PIOE_OWDR_P20 Output Write Disable. **/
#define PIOE_OWDR_P20		(1 << 20)
/** PIOE_OWDR_P19 Output Write Disable. **/
#define PIOE_OWDR_P19		(1 << 19)
/** PIOE_OWDR_P18 Output Write Disable. **/
#define PIOE_OWDR_P18		(1 << 18)
/** PIOE_OWDR_P17 Output Write Disable. **/
#define PIOE_OWDR_P17		(1 << 17)
/** PIOE_OWDR_P16 Output Write Disable. **/
#define PIOE_OWDR_P16		(1 << 16)
/** PIOE_OWDR_P15 Output Write Disable. **/
#define PIOE_OWDR_P15		(1 << 15)
/** PIOE_OWDR_P14 Output Write Disable. **/
#define PIOE_OWDR_P14		(1 << 14)
/** PIOE_OWDR_P13 Output Write Disable. **/
#define PIOE_OWDR_P13		(1 << 13)
/** PIOE_OWDR_P12 Output Write Disable. **/
#define PIOE_OWDR_P12		(1 << 12)
/** PIOE_OWDR_P11 Output Write Disable. **/
#define PIOE_OWDR_P11		(1 << 11)
/** PIOE_OWDR_P10 Output Write Disable. **/
#define PIOE_OWDR_P10		(1 << 10)
/** PIOE_OWDR_P9 Output Write Disable. **/
#define PIOE_OWDR_P9		(1 << 9)
/** PIOE_OWDR_P8 Output Write Disable. **/
#define PIOE_OWDR_P8		(1 << 8)
/** PIOE_OWDR_P7 Output Write Disable. **/
#define PIOE_OWDR_P7		(1 << 7)
/** PIOE_OWDR_P6 Output Write Disable. **/
#define PIOE_OWDR_P6		(1 << 6)
/** PIOE_OWDR_P5 Output Write Disable. **/
#define PIOE_OWDR_P5		(1 << 5)
/** PIOE_OWDR_P4 Output Write Disable. **/
#define PIOE_OWDR_P4		(1 << 4)
/** PIOE_OWDR_P3 Output Write Disable. **/
#define PIOE_OWDR_P3		(1 << 3)
/** PIOE_OWDR_P2 Output Write Disable. **/
#define PIOE_OWDR_P2		(1 << 2)
/** PIOE_OWDR_P1 Output Write Disable. **/
#define PIOE_OWDR_P1		(1 << 1)
/** PIOE_OWDR_P0 Output Write Disable. **/
#define PIOE_OWDR_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_owsr OWSR Output Write Status Register
@{*/

/** PIOE_OWSR_P31 Output Write Status. **/
#define PIOE_OWSR_P31		(1 << 31)
/** PIOE_OWSR_P30 Output Write Status. **/
#define PIOE_OWSR_P30		(1 << 30)
/** PIOE_OWSR_P29 Output Write Status. **/
#define PIOE_OWSR_P29		(1 << 29)
/** PIOE_OWSR_P28 Output Write Status. **/
#define PIOE_OWSR_P28		(1 << 28)
/** PIOE_OWSR_P27 Output Write Status. **/
#define PIOE_OWSR_P27		(1 << 27)
/** PIOE_OWSR_P26 Output Write Status. **/
#define PIOE_OWSR_P26		(1 << 26)
/** PIOE_OWSR_P25 Output Write Status. **/
#define PIOE_OWSR_P25		(1 << 25)
/** PIOE_OWSR_P24 Output Write Status. **/
#define PIOE_OWSR_P24		(1 << 24)
/** PIOE_OWSR_P23 Output Write Status. **/
#define PIOE_OWSR_P23		(1 << 23)
/** PIOE_OWSR_P22 Output Write Status. **/
#define PIOE_OWSR_P22		(1 << 22)
/** PIOE_OWSR_P21 Output Write Status. **/
#define PIOE_OWSR_P21		(1 << 21)
/** PIOE_OWSR_P20 Output Write Status. **/
#define PIOE_OWSR_P20		(1 << 20)
/** PIOE_OWSR_P19 Output Write Status. **/
#define PIOE_OWSR_P19		(1 << 19)
/** PIOE_OWSR_P18 Output Write Status. **/
#define PIOE_OWSR_P18		(1 << 18)
/** PIOE_OWSR_P17 Output Write Status. **/
#define PIOE_OWSR_P17		(1 << 17)
/** PIOE_OWSR_P16 Output Write Status. **/
#define PIOE_OWSR_P16		(1 << 16)
/** PIOE_OWSR_P15 Output Write Status. **/
#define PIOE_OWSR_P15		(1 << 15)
/** PIOE_OWSR_P14 Output Write Status. **/
#define PIOE_OWSR_P14		(1 << 14)
/** PIOE_OWSR_P13 Output Write Status. **/
#define PIOE_OWSR_P13		(1 << 13)
/** PIOE_OWSR_P12 Output Write Status. **/
#define PIOE_OWSR_P12		(1 << 12)
/** PIOE_OWSR_P11 Output Write Status. **/
#define PIOE_OWSR_P11		(1 << 11)
/** PIOE_OWSR_P10 Output Write Status. **/
#define PIOE_OWSR_P10		(1 << 10)
/** PIOE_OWSR_P9 Output Write Status. **/
#define PIOE_OWSR_P9		(1 << 9)
/** PIOE_OWSR_P8 Output Write Status. **/
#define PIOE_OWSR_P8		(1 << 8)
/** PIOE_OWSR_P7 Output Write Status. **/
#define PIOE_OWSR_P7		(1 << 7)
/** PIOE_OWSR_P6 Output Write Status. **/
#define PIOE_OWSR_P6		(1 << 6)
/** PIOE_OWSR_P5 Output Write Status. **/
#define PIOE_OWSR_P5		(1 << 5)
/** PIOE_OWSR_P4 Output Write Status. **/
#define PIOE_OWSR_P4		(1 << 4)
/** PIOE_OWSR_P3 Output Write Status. **/
#define PIOE_OWSR_P3		(1 << 3)
/** PIOE_OWSR_P2 Output Write Status. **/
#define PIOE_OWSR_P2		(1 << 2)
/** PIOE_OWSR_P1 Output Write Status. **/
#define PIOE_OWSR_P1		(1 << 1)
/** PIOE_OWSR_P0 Output Write Status. **/
#define PIOE_OWSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_aimer AIMER Additional Interrupt Modes Enable Register
@{*/

/** PIOE_AIMER_P31 Additional Interrupt Modes Enable. **/
#define PIOE_AIMER_P31		(1 << 31)
/** PIOE_AIMER_P30 Additional Interrupt Modes Enable. **/
#define PIOE_AIMER_P30		(1 << 30)
/** PIOE_AIMER_P29 Additional Interrupt Modes Enable. **/
#define PIOE_AIMER_P29		(1 << 29)
/** PIOE_AIMER_P28 Additional Interrupt Modes Enable. **/
#define PIOE_AIMER_P28		(1 << 28)
/** PIOE_AIMER_P27 Additional Interrupt Modes Enable. **/
#define PIOE_AIMER_P27		(1 << 27)
/** PIOE_AIMER_P26 Additional Interrupt Modes Enable. **/
#define PIOE_AIMER_P26		(1 << 26)
/** PIOE_AIMER_P25 Additional Interrupt Modes Enable. **/
#define PIOE_AIMER_P25		(1 << 25)
/** PIOE_AIMER_P24 Additional Interrupt Modes Enable. **/
#define PIOE_AIMER_P24		(1 << 24)
/** PIOE_AIMER_P23 Additional Interrupt Modes Enable. **/
#define PIOE_AIMER_P23		(1 << 23)
/** PIOE_AIMER_P22 Additional Interrupt Modes Enable. **/
#define PIOE_AIMER_P22		(1 << 22)
/** PIOE_AIMER_P21 Additional Interrupt Modes Enable. **/
#define PIOE_AIMER_P21		(1 << 21)
/** PIOE_AIMER_P20 Additional Interrupt Modes Enable. **/
#define PIOE_AIMER_P20		(1 << 20)
/** PIOE_AIMER_P19 Additional Interrupt Modes Enable. **/
#define PIOE_AIMER_P19		(1 << 19)
/** PIOE_AIMER_P18 Additional Interrupt Modes Enable. **/
#define PIOE_AIMER_P18		(1 << 18)
/** PIOE_AIMER_P17 Additional Interrupt Modes Enable. **/
#define PIOE_AIMER_P17		(1 << 17)
/** PIOE_AIMER_P16 Additional Interrupt Modes Enable. **/
#define PIOE_AIMER_P16		(1 << 16)
/** PIOE_AIMER_P15 Additional Interrupt Modes Enable. **/
#define PIOE_AIMER_P15		(1 << 15)
/** PIOE_AIMER_P14 Additional Interrupt Modes Enable. **/
#define PIOE_AIMER_P14		(1 << 14)
/** PIOE_AIMER_P13 Additional Interrupt Modes Enable. **/
#define PIOE_AIMER_P13		(1 << 13)
/** PIOE_AIMER_P12 Additional Interrupt Modes Enable. **/
#define PIOE_AIMER_P12		(1 << 12)
/** PIOE_AIMER_P11 Additional Interrupt Modes Enable. **/
#define PIOE_AIMER_P11		(1 << 11)
/** PIOE_AIMER_P10 Additional Interrupt Modes Enable. **/
#define PIOE_AIMER_P10		(1 << 10)
/** PIOE_AIMER_P9 Additional Interrupt Modes Enable. **/
#define PIOE_AIMER_P9		(1 << 9)
/** PIOE_AIMER_P8 Additional Interrupt Modes Enable. **/
#define PIOE_AIMER_P8		(1 << 8)
/** PIOE_AIMER_P7 Additional Interrupt Modes Enable. **/
#define PIOE_AIMER_P7		(1 << 7)
/** PIOE_AIMER_P6 Additional Interrupt Modes Enable. **/
#define PIOE_AIMER_P6		(1 << 6)
/** PIOE_AIMER_P5 Additional Interrupt Modes Enable. **/
#define PIOE_AIMER_P5		(1 << 5)
/** PIOE_AIMER_P4 Additional Interrupt Modes Enable. **/
#define PIOE_AIMER_P4		(1 << 4)
/** PIOE_AIMER_P3 Additional Interrupt Modes Enable. **/
#define PIOE_AIMER_P3		(1 << 3)
/** PIOE_AIMER_P2 Additional Interrupt Modes Enable. **/
#define PIOE_AIMER_P2		(1 << 2)
/** PIOE_AIMER_P1 Additional Interrupt Modes Enable. **/
#define PIOE_AIMER_P1		(1 << 1)
/** PIOE_AIMER_P0 Additional Interrupt Modes Enable. **/
#define PIOE_AIMER_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_aimdr AIMDR Additional Interrupt Modes Disables Register
@{*/

/** PIOE_AIMDR_P31 Additional Interrupt Modes Disable. **/
#define PIOE_AIMDR_P31		(1 << 31)
/** PIOE_AIMDR_P30 Additional Interrupt Modes Disable. **/
#define PIOE_AIMDR_P30		(1 << 30)
/** PIOE_AIMDR_P29 Additional Interrupt Modes Disable. **/
#define PIOE_AIMDR_P29		(1 << 29)
/** PIOE_AIMDR_P28 Additional Interrupt Modes Disable. **/
#define PIOE_AIMDR_P28		(1 << 28)
/** PIOE_AIMDR_P27 Additional Interrupt Modes Disable. **/
#define PIOE_AIMDR_P27		(1 << 27)
/** PIOE_AIMDR_P26 Additional Interrupt Modes Disable. **/
#define PIOE_AIMDR_P26		(1 << 26)
/** PIOE_AIMDR_P25 Additional Interrupt Modes Disable. **/
#define PIOE_AIMDR_P25		(1 << 25)
/** PIOE_AIMDR_P24 Additional Interrupt Modes Disable. **/
#define PIOE_AIMDR_P24		(1 << 24)
/** PIOE_AIMDR_P23 Additional Interrupt Modes Disable. **/
#define PIOE_AIMDR_P23		(1 << 23)
/** PIOE_AIMDR_P22 Additional Interrupt Modes Disable. **/
#define PIOE_AIMDR_P22		(1 << 22)
/** PIOE_AIMDR_P21 Additional Interrupt Modes Disable. **/
#define PIOE_AIMDR_P21		(1 << 21)
/** PIOE_AIMDR_P20 Additional Interrupt Modes Disable. **/
#define PIOE_AIMDR_P20		(1 << 20)
/** PIOE_AIMDR_P19 Additional Interrupt Modes Disable. **/
#define PIOE_AIMDR_P19		(1 << 19)
/** PIOE_AIMDR_P18 Additional Interrupt Modes Disable. **/
#define PIOE_AIMDR_P18		(1 << 18)
/** PIOE_AIMDR_P17 Additional Interrupt Modes Disable. **/
#define PIOE_AIMDR_P17		(1 << 17)
/** PIOE_AIMDR_P16 Additional Interrupt Modes Disable. **/
#define PIOE_AIMDR_P16		(1 << 16)
/** PIOE_AIMDR_P15 Additional Interrupt Modes Disable. **/
#define PIOE_AIMDR_P15		(1 << 15)
/** PIOE_AIMDR_P14 Additional Interrupt Modes Disable. **/
#define PIOE_AIMDR_P14		(1 << 14)
/** PIOE_AIMDR_P13 Additional Interrupt Modes Disable. **/
#define PIOE_AIMDR_P13		(1 << 13)
/** PIOE_AIMDR_P12 Additional Interrupt Modes Disable. **/
#define PIOE_AIMDR_P12		(1 << 12)
/** PIOE_AIMDR_P11 Additional Interrupt Modes Disable. **/
#define PIOE_AIMDR_P11		(1 << 11)
/** PIOE_AIMDR_P10 Additional Interrupt Modes Disable. **/
#define PIOE_AIMDR_P10		(1 << 10)
/** PIOE_AIMDR_P9 Additional Interrupt Modes Disable. **/
#define PIOE_AIMDR_P9		(1 << 9)
/** PIOE_AIMDR_P8 Additional Interrupt Modes Disable. **/
#define PIOE_AIMDR_P8		(1 << 8)
/** PIOE_AIMDR_P7 Additional Interrupt Modes Disable. **/
#define PIOE_AIMDR_P7		(1 << 7)
/** PIOE_AIMDR_P6 Additional Interrupt Modes Disable. **/
#define PIOE_AIMDR_P6		(1 << 6)
/** PIOE_AIMDR_P5 Additional Interrupt Modes Disable. **/
#define PIOE_AIMDR_P5		(1 << 5)
/** PIOE_AIMDR_P4 Additional Interrupt Modes Disable. **/
#define PIOE_AIMDR_P4		(1 << 4)
/** PIOE_AIMDR_P3 Additional Interrupt Modes Disable. **/
#define PIOE_AIMDR_P3		(1 << 3)
/** PIOE_AIMDR_P2 Additional Interrupt Modes Disable. **/
#define PIOE_AIMDR_P2		(1 << 2)
/** PIOE_AIMDR_P1 Additional Interrupt Modes Disable. **/
#define PIOE_AIMDR_P1		(1 << 1)
/** PIOE_AIMDR_P0 Additional Interrupt Modes Disable. **/
#define PIOE_AIMDR_P0		(1 << 0)

/**@}*/

