grevaillot/svd_tools/headers/ATSAM3X8H/pioe.h
/** @defgroup pioe_elsr ELSR Edge/Level Status Register
@{*/

/** PIOE_ELSR_P31 Edge/Level Interrupt source selection. **/
#define PIOE_ELSR_P31		(1 << 31)
/** PIOE_ELSR_P30 Edge/Level Interrupt source selection. **/
#define PIOE_ELSR_P30		(1 << 30)
/** PIOE_ELSR_P29 Edge/Level Interrupt source selection. **/
#define PIOE_ELSR_P29		(1 << 29)
/** PIOE_ELSR_P28 Edge/Level Interrupt source selection. **/
#define PIOE_ELSR_P28		(1 << 28)
/** PIOE_ELSR_P27 Edge/Level Interrupt source selection. **/
#define PIOE_ELSR_P27		(1 << 27)
/** PIOE_ELSR_P26 Edge/Level Interrupt source selection. **/
#define PIOE_ELSR_P26		(1 << 26)
/** PIOE_ELSR_P25 Edge/Level Interrupt source selection. **/
#define PIOE_ELSR_P25		(1 << 25)
/** PIOE_ELSR_P24 Edge/Level Interrupt source selection. **/
#define PIOE_ELSR_P24		(1 << 24)
/** PIOE_ELSR_P23 Edge/Level Interrupt source selection. **/
#define PIOE_ELSR_P23		(1 << 23)
/** PIOE_ELSR_P22 Edge/Level Interrupt source selection. **/
#define PIOE_ELSR_P22		(1 << 22)
/** PIOE_ELSR_P21 Edge/Level Interrupt source selection. **/
#define PIOE_ELSR_P21		(1 << 21)
/** PIOE_ELSR_P20 Edge/Level Interrupt source selection. **/
#define PIOE_ELSR_P20		(1 << 20)
/** PIOE_ELSR_P19 Edge/Level Interrupt source selection. **/
#define PIOE_ELSR_P19		(1 << 19)
/** PIOE_ELSR_P18 Edge/Level Interrupt source selection. **/
#define PIOE_ELSR_P18		(1 << 18)
/** PIOE_ELSR_P17 Edge/Level Interrupt source selection. **/
#define PIOE_ELSR_P17		(1 << 17)
/** PIOE_ELSR_P16 Edge/Level Interrupt source selection. **/
#define PIOE_ELSR_P16		(1 << 16)
/** PIOE_ELSR_P15 Edge/Level Interrupt source selection. **/
#define PIOE_ELSR_P15		(1 << 15)
/** PIOE_ELSR_P14 Edge/Level Interrupt source selection. **/
#define PIOE_ELSR_P14		(1 << 14)
/** PIOE_ELSR_P13 Edge/Level Interrupt source selection. **/
#define PIOE_ELSR_P13		(1 << 13)
/** PIOE_ELSR_P12 Edge/Level Interrupt source selection. **/
#define PIOE_ELSR_P12		(1 << 12)
/** PIOE_ELSR_P11 Edge/Level Interrupt source selection. **/
#define PIOE_ELSR_P11		(1 << 11)
/** PIOE_ELSR_P10 Edge/Level Interrupt source selection. **/
#define PIOE_ELSR_P10		(1 << 10)
/** PIOE_ELSR_P9 Edge/Level Interrupt source selection. **/
#define PIOE_ELSR_P9		(1 << 9)
/** PIOE_ELSR_P8 Edge/Level Interrupt source selection. **/
#define PIOE_ELSR_P8		(1 << 8)
/** PIOE_ELSR_P7 Edge/Level Interrupt source selection. **/
#define PIOE_ELSR_P7		(1 << 7)
/** PIOE_ELSR_P6 Edge/Level Interrupt source selection. **/
#define PIOE_ELSR_P6		(1 << 6)
/** PIOE_ELSR_P5 Edge/Level Interrupt source selection. **/
#define PIOE_ELSR_P5		(1 << 5)
/** PIOE_ELSR_P4 Edge/Level Interrupt source selection. **/
#define PIOE_ELSR_P4		(1 << 4)
/** PIOE_ELSR_P3 Edge/Level Interrupt source selection. **/
#define PIOE_ELSR_P3		(1 << 3)
/** PIOE_ELSR_P2 Edge/Level Interrupt source selection. **/
#define PIOE_ELSR_P2		(1 << 2)
/** PIOE_ELSR_P1 Edge/Level Interrupt source selection. **/
#define PIOE_ELSR_P1		(1 << 1)
/** PIOE_ELSR_P0 Edge/Level Interrupt source selection. **/
#define PIOE_ELSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_fellsr FELLSR Falling Edge/Low Level Select Register
@{*/

/** PIOE_FELLSR_P31 Falling Edge/Low Level Interrupt Selection. **/
#define PIOE_FELLSR_P31		(1 << 31)
/** PIOE_FELLSR_P30 Falling Edge/Low Level Interrupt Selection. **/
#define PIOE_FELLSR_P30		(1 << 30)
/** PIOE_FELLSR_P29 Falling Edge/Low Level Interrupt Selection. **/
#define PIOE_FELLSR_P29		(1 << 29)
/** PIOE_FELLSR_P28 Falling Edge/Low Level Interrupt Selection. **/
#define PIOE_FELLSR_P28		(1 << 28)
/** PIOE_FELLSR_P27 Falling Edge/Low Level Interrupt Selection. **/
#define PIOE_FELLSR_P27		(1 << 27)
/** PIOE_FELLSR_P26 Falling Edge/Low Level Interrupt Selection. **/
#define PIOE_FELLSR_P26		(1 << 26)
/** PIOE_FELLSR_P25 Falling Edge/Low Level Interrupt Selection. **/
#define PIOE_FELLSR_P25		(1 << 25)
/** PIOE_FELLSR_P24 Falling Edge/Low Level Interrupt Selection. **/
#define PIOE_FELLSR_P24		(1 << 24)
/** PIOE_FELLSR_P23 Falling Edge/Low Level Interrupt Selection. **/
#define PIOE_FELLSR_P23		(1 << 23)
/** PIOE_FELLSR_P22 Falling Edge/Low Level Interrupt Selection. **/
#define PIOE_FELLSR_P22		(1 << 22)
/** PIOE_FELLSR_P21 Falling Edge/Low Level Interrupt Selection. **/
#define PIOE_FELLSR_P21		(1 << 21)
/** PIOE_FELLSR_P20 Falling Edge/Low Level Interrupt Selection. **/
#define PIOE_FELLSR_P20		(1 << 20)
/** PIOE_FELLSR_P19 Falling Edge/Low Level Interrupt Selection. **/
#define PIOE_FELLSR_P19		(1 << 19)
/** PIOE_FELLSR_P18 Falling Edge/Low Level Interrupt Selection. **/
#define PIOE_FELLSR_P18		(1 << 18)
/** PIOE_FELLSR_P17 Falling Edge/Low Level Interrupt Selection. **/
#define PIOE_FELLSR_P17		(1 << 17)
/** PIOE_FELLSR_P16 Falling Edge/Low Level Interrupt Selection. **/
#define PIOE_FELLSR_P16		(1 << 16)
/** PIOE_FELLSR_P15 Falling Edge/Low Level Interrupt Selection. **/
#define PIOE_FELLSR_P15		(1 << 15)
/** PIOE_FELLSR_P14 Falling Edge/Low Level Interrupt Selection. **/
#define PIOE_FELLSR_P14		(1 << 14)
/** PIOE_FELLSR_P13 Falling Edge/Low Level Interrupt Selection. **/
#define PIOE_FELLSR_P13		(1 << 13)
/** PIOE_FELLSR_P12 Falling Edge/Low Level Interrupt Selection. **/
#define PIOE_FELLSR_P12		(1 << 12)
/** PIOE_FELLSR_P11 Falling Edge/Low Level Interrupt Selection. **/
#define PIOE_FELLSR_P11		(1 << 11)
/** PIOE_FELLSR_P10 Falling Edge/Low Level Interrupt Selection. **/
#define PIOE_FELLSR_P10		(1 << 10)
/** PIOE_FELLSR_P9 Falling Edge/Low Level Interrupt Selection. **/
#define PIOE_FELLSR_P9		(1 << 9)
/** PIOE_FELLSR_P8 Falling Edge/Low Level Interrupt Selection. **/
#define PIOE_FELLSR_P8		(1 << 8)
/** PIOE_FELLSR_P7 Falling Edge/Low Level Interrupt Selection. **/
#define PIOE_FELLSR_P7		(1 << 7)
/** PIOE_FELLSR_P6 Falling Edge/Low Level Interrupt Selection. **/
#define PIOE_FELLSR_P6		(1 << 6)
/** PIOE_FELLSR_P5 Falling Edge/Low Level Interrupt Selection. **/
#define PIOE_FELLSR_P5		(1 << 5)
/** PIOE_FELLSR_P4 Falling Edge/Low Level Interrupt Selection. **/
#define PIOE_FELLSR_P4		(1 << 4)
/** PIOE_FELLSR_P3 Falling Edge/Low Level Interrupt Selection. **/
#define PIOE_FELLSR_P3		(1 << 3)
/** PIOE_FELLSR_P2 Falling Edge/Low Level Interrupt Selection. **/
#define PIOE_FELLSR_P2		(1 << 2)
/** PIOE_FELLSR_P1 Falling Edge/Low Level Interrupt Selection. **/
#define PIOE_FELLSR_P1		(1 << 1)
/** PIOE_FELLSR_P0 Falling Edge/Low Level Interrupt Selection. **/
#define PIOE_FELLSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_rehlsr REHLSR Rising Edge/ High Level Select Register
@{*/

